lin-dyn-sys-stanford.tex
% Created 2011-08-19 Fri 12:09
% BEGIN My Article Defaults
    \documentclass[10pt,letterpaper]{article}
    
    \usepackage[letterpaper,includeheadfoot,top=0.5in,bottom=0.5in,left=0.75in,right=0.75in]{geometry}
    \usepackage[utf8]{inputenc}
    \usepackage[T1]{fontenc}
    \usepackage{hyperref}
    \usepackage{lastpage}
    \usepackage{fancyhdr}
    \usepackage[all]{xy}              %for doing graphics http://en.wikibooks.org/wiki/LaTeX/Creating_Graphics#Xy-pic
    \pagestyle{fancy}
    \renewcommand{\headrulewidth}{1pt}
    \renewcommand{\footrulewidth}{0.5pt}
    
    % For the engineering phasor symbol
    % http://newsgroups.derkeiler.com/Archive/Comp/comp.text.tex/2006-02/msg00895.html
    \makeatletter
    \def\phase#1{{\vbox{\ialign{$\m@th\scriptstyle##$\crcr
    \not\mathrel{\mkern10mu\smash{#1}}\crcr
    \noalign{\nointerlineskip}
    \mkern2.5mu\leaders\hrule height.34pt\hfill\mkern2.5mu\crcr}}}}
    \makeatother
    
    % Default footer
    \fancyfoot[L]{\small \jobname \\ \today}
    \fancyfoot[C]{\small Page \thepage\ of \pageref{LastPage}}
    \fancyfoot[R]{\small \copyright \the\year\  Chris Beard}
    % END My Article Defaults
    
    
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage[integrals]{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{amsmath}
\providecommand{\alert}[1]{\textbf{#1}}
\begin{document}



\title{Linear Dynamic Systems Notes}
\author{Chris Beard}
\date{19 August 2011}
\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
Following notes based on the \href{file://.~/Desktop/Engineering/kiet-ee-downloads/current/ee263_course_reader.pdf}{EE263 Course Reader}. Orgmode $\rightarrow$ \LaTeXe

\begin{center}
\begin{tabular}{ll}
 \href{http://www.stanford.edu/~boyd/ee263/matlab/}{Matlab files}                                       &  \href{file://.~/Dropbox/AK-MBP/edu/systems/linear-algebra-notes.pdf}{Linear Algebra}  \\
 \href{file:///Users/FingerMan/Dropbox/AK-MBP/edu/systems/IntroToLinearDynamicalSys/index.html}{Index}  &                                                                                        \\
\end{tabular}
\end{center}


\section{Lecture 2}
\label{sec-1}

\href{file:///Users/FingerMan/Dropbox/AK-MBP/edu/systems/IntroToLinearDynamicalSys/materials/lsoeldsee263/02-lin-fcts.pdf}{Official Lecture Notes}
\subsection{Interpretation for $y=Ax$}
\label{sec-1_1}

\begin{itemize}
\item $A$ a transformation matrix
\item $y$ an observed measurement, $x$ an unknown
\item $x$ is input, $y$ is output; for rows $i$ and columns $j$ in $A$, ${\bf i \rightarrow y}$, ${\bf j \rightarrow x}$

\begin{itemize}
\item indexed as \bf output, input
\end{itemize}

\item Lower diagonal Matrix should make you expect or have a vague thought about causality.

\begin{itemize}
\item $a_{ij}=0$ for $i<j \Rightarrow y_i$ only depends on $x_1,...,x_i$
\item $A$ is diagonal; output only depends on input
\end{itemize}

\item Sparcity pattern (block of zeroes) in a matrix should have you wonder why\ldots{}usually not coincidental
\item $A_{35}$ positive $\Rightarrow x_5$ increased corresponds to an increase in 3rd output, $y_3$
\end{itemize}
\subsection{Example in notes}
\label{sec-1_2}
\subsubsection{Linear elastic structure}
\label{sec-1_2_1}

\begin{itemize}
\item $a_{11}$ probably positive

\begin{itemize}
\item $x_1$ input gives positive push to $y_1$ output
\end{itemize}

\end{itemize}
\subsubsection{Force/Torque on rigid body}
\label{sec-1_2_2}

\begin{itemize}
\item Net torque/force on body is linearly related to force inputs
\end{itemize}
\subsubsection{Thermal System}
\label{sec-1_2_3}

\begin{itemize}
\item despite normally needing a Poisson equation, the steady state heat of the different locations can be represented as a linear system $Ax=y$
\end{itemize}
\section{Lecture 3}
\label{sec-2}
\subsection{Review of Linearization (affine approximation)}
\label{sec-2_1}

  \begin{enumerate}
  \item  If $f: {\bf R}^{n} \rightarrow {\bf R}^{m} $ is differentiable at $x_{0} \in {\bf R} ^{n}$, then
  $x$ near $x_{0} \Rightarrow f(x)$ very near $f(x_{0}) + D f(x_{0})(x-x_{0})$
  where
  $$
  Df(x_{0})_{ij}= \frac{\partial f_{i}}{\partial x_{j}} \bigg|_{x_{0}}
  $$
  is the derivative (Jacobian) matrix.
  
  \item with $y=f(x), y_{0}=f(x_{0})$, define `input deviation' $\delta x := x-x_{0}$, `output deviation' $\delta y:= y-y_{0}$
  \item then we have $\delta y \approx Df(x_{0})\delta x$
  \subitem i.e., we get a linear function for looking at how the output changes with small changes in the input
  \item When deviations are small, they are approximately related by a linear function
  
  \end{enumerate}
\subsubsection{Good intuition range-finding problem}
\label{sec-2_1_1}
\subsection{Intepretations of $Ax=y$}
\label{sec-2_2}

\begin{itemize}
\item Scaled combination of columns in $A$

  $A=[ a_1 a_{2} ... a_{n}] \rightarrow y=x_{1}a_{1}+x_{2}a_{2}+...+x_{n}a_{n}$
\item Looking at the rows: the multiplication is the inner product of rows and vector $x$
\item I/O ordering is backwards in control; in $A_{ij}$, $j$ refers to input and $i$ refers to output

\begin{itemize}
\item indexing is likewise backwards in block diagram indexing
\end{itemize}

\end{itemize}
  $AB=I$; $\tilde a_{i}^{T} \cdot b_{j}=0$ if $i\ne j$, where $\tilde a_{i}$ is the $ith$ row in $A$, and $b_{j}$ is $jth$ column in $B$ 
\subsubsection{Computing $C=AB$}
\label{sec-2_2_1}

How to compute this faster than using formula $c_{ij}=\sum_{k=1} A_{ik} B_{kj}$: have computer break it up into submatrices and do the multiplication on them
\subsubsection{Zero nullspace (in notes)}
\label{sec-2_2_2}

\begin{itemize}
\item if 0 is only element in $\mathcal{N}(A)$

\begin{itemize}
\item $A$ is one-to-one

\begin{itemize}
\item linear transformation doesn't lose information
\end{itemize}

\item columns of $A$ are independent, and basis for their span
\item $A$ has a left inverse $\Rightarrow$ you can use this to undo the transformation and find the input $x$, given the output $y$
\item $|A^T A|\ne0$
\end{itemize}

\end{itemize}
\subsubsection{Interpretations of nullspace}
\label{sec-2_2_3}

supposing $z \in \mathcal{N}(A)$ 
\begin{itemize}
\item Measurements

\begin{itemize}
\item $z$ is undetectable from sensors
\item $x$ and $x+z$ are indistinguishable from sensors: $Ax = A(x+z)$
\item the nullspace characterizes ambiguity in $x$ from measurement $y=Ax$

\begin{itemize}
\item large nullspace is bad
\end{itemize}

\end{itemize}

\item $y=Ax$ is output from input $x$

\begin{itemize}
\item $z$ is input with no result
\item $x$ and $x+z$ have same result
\item the nullspace characterizes freedom of input choice for given result

\begin{itemize}
\item large nullspace is good: more room for optimization because of more input possibilities
\end{itemize}

\end{itemize}

\end{itemize}
\subsubsection{Range}
\label{sec-2_2_4}

Range of $A \in \mathbb{R}^{m\times n}$ defined as $\mathcal{R}(A)=\{Ax | x \in \mathbb{R}^n\} \subseteq \mathbb{R}^m$ 
\begin{itemize}
\item The set of vectors that can be `hit' by linear mapping $y=Ax$
\item span of columns of $A$
\item set of vectors $y$ for which $Ax=y$ has a solution
\item possible sensor measurement

\begin{itemize}
\item in design, you'll want to throw an exception if a measurement is outside the range; the sensor is bad
\item test for a bad 13th sensor: remove 13th row in $A$; if the reduced $y$ is in the range of the reduced matrix, the 13th sensor might not have been bad
\end{itemize}

\end{itemize}
\begin{itemize}

\item Onto matrices\\
\label{sec-2_2_4_1}%
$A$ is `onto' if $\mathcal{R}(A)=\mathbb{R}^m$
\begin{itemize}
\item you can solve $Ax=y$ for any $y$
\item columns of $A$ span $\mathbb{R}^m$
\item $A$ has a right inverse $B$ s.t. $AB=I$

\begin{itemize}
\item can do $ABy=A(By)=y$: you want an $x$ that gives you $y$? Here it is.
\item Design procedure
\end{itemize}

\item rows of $A$ are independent

\begin{itemize}
\item a.k.a., $\mathcal{N}(A^T)=\{0\}$
\end{itemize}

\item $|AA^T|\ne 0$
\end{itemize}

\item Interpretations of range
\label{sec-2_2_4_2}%
\begin{itemize}
\item supposing $v \in \mathcal{R}(A)$

\begin{itemize}
\item $v$ reachable
\item else, not reachable
\end{itemize}

\end{itemize}


\item Inverse\\
\label{sec-2_2_4_3}%
Note: square matrices are impractical for engineering. They don't let you take advantoge of redundant sensors/controllers, or let you build a robust system to take care of broken sensors
\begin{itemize}
\item $A \in \mathbb{R}^{n \times n}$ is invertible or nonsingular if det $A \ne 0$

\begin{itemize}
\item columns of $A$ are basis for $\mathbb{R}^n$
\item rows of $A$ are basis for $\mathbb{R}^n$
\item $y=Ax$ has a unique solution $x$ for every $y \in \mathbb{R}^n$
\item $A$ has left and right inverse $A^{-1} \in \mathbb{R}^{n\times n}$, s.t. $AA^{-1}=A^{-1}A=I$
\item $\mathcal{N}(A)= \{0\}$
\item $\mathcal{R}(A)=\mathbb{R}^n$
\item det $A^T A= |AA^T| \ne 0$
\end{itemize}

\end{itemize}
\begin{itemize}
