lin-dyn-sys-stanford.tex

\item Dual basis intepretation of inverse\\
\label{sec-2_2_4_3_1}%
$a_i$ are columns of $A$, and $\tilde b_i^T$ are rows of $B=A^{-1}$
\begin{itemize}
\item $y=Ax$, column by column, looks like $y=x_1 a_1 + ... + x_n a_n$

\begin{itemize}
\item multiply both sides of $y=Ax$ by $A^{-1}=B$ gives $x=By$
\item so $x_i=\tilde b_i^T y$
\end{itemize}

\end{itemize}

\[
\begin{bmatrix}
  \vdots & \vdots & \vdots & \vdots \\
  a_1    & a_2    & ...    & a_n    \\
  \vdots & \vdots & \vdots & \vdots \\
\end{bmatrix}
\begin{bmatrix}
  x_1      \\
  x_2      \\
  \vdots   \\
  x_n      \\
\end{bmatrix}
=
\begin{bmatrix}
  y_1      \\
  y_2      \\
  \vdots   \\
  y_n      \\
\end{bmatrix}
\]

\[
x=A^{-1} y
\]

\[
\begin{bmatrix}
  x_1      \\
  x_2      \\
  \vdots   \\
  x_n      \\
\end{bmatrix}
=
\begin{bmatrix}
  \cdots & \tilde b^T_1 & \cdots \\
  \cdots & \tilde b^T_2 & \cdots \\
  \cdots & \vdots       & \cdots \\
  \cdots & \tilde b^T_n & \cdots \\
\end{bmatrix}
\begin{bmatrix}
  y_1      \\
  y_2      \\
  \vdots   \\
  y_n      \\
\end{bmatrix}
\]

\[
\begin{bmatrix}
  y_1      \\
  y_2      \\
  \vdots   \\
  y_n      \\
\end{bmatrix}
=
\begin{bmatrix}
x_1 a_1 + ... + x_n a_n
\end{bmatrix}
=
\begin{bmatrix}
(\tilde b^T_1 y) a_1 + ... + (\tilde b^T_n y) a_n
\end{bmatrix}
\]

Beautiful thing:
\[
y=\sum_{i=1}^n (\tilde b_i ^T y) a_i
\]

\end{itemize} % ends low level
\end{itemize} % ends low level
\subsubsection{Rank of matrix}
\label{sec-2_2_5}

Rank of $A \in \mathbb{R}^{m \times n}$ as ${\bf rank}(A)= {\bf dim} \mathcal{R}(A)$
\begin{itemize}
\item ${\bf rank} (A)= {\bf rank} (A^T)$
\item ${\bf rank} (A)$ is maximum number of independent columns or rows of $A$: ${\bf rank} (A) \le {\bf min} (m,n)$
\item ${\bf rank} (A)+ {\bf dim} \mathcal{N}(A)=n$
\end{itemize}
\begin{itemize}

\item Conservation of degrees of freedom (dimension)
\label{sec-2_2_5_1}%
\begin{itemize}
\item ${\bf rank} (A)$ is dimension of set `hit' by mapping $y=Ax$
\item ${\bf dim} \mathcal{N}(A)$ is dimension of set of $x$ `crushed' to zero by $y=Ax$
\end{itemize}
\begin{itemize}

\item Example
\label{sec-2_2_5_1_1}%
\begin{itemize}
\item $A \in \mathbb{R}^{20 \times 10} {\bf rank} (A)=8$

\begin{itemize}
\item you can do 8 dimensions worth of stuff
\item 10 knobs, 2 redundant knobs, which is ${\bf dim} \mathcal{N}(A)=2$
\end{itemize}

\end{itemize}
\end{itemize} % ends low level

\item Coding interpretation of rank
\label{sec-2_2_5_2}%
\begin{itemize}
\item rank of product: ${\bf rank} (BC) \le {\bf min} \{ {\bf rank} (B), {\bf rank} (C)\}$
\item supposedly really cool stuff based on this
\item low rank matrices let you do fast computations
\end{itemize}
\end{itemize} % ends low level
\subsubsection{Various wrap-up items}
\label{sec-2_2_6}
\begin{itemize}

\item RMS\\
\label{sec-2_2_6_1}%
\[
{\bf rms} (x) = \left( \frac{1}{n} \sum^n _{i=1} \right) ^{1/2} = \frac{\| x \|}{\sqrt{n}} 
\]

\item Inner product\\
\label{sec-2_2_6_2}%
$\langle x,y \rangle := x_1 y_1 + x_2 y_2 + \cdots + x_n y_n = x ^{T} y$ 
\begin{itemize}
\item intepretation of inner product signs:
\item $x ^{T} y > 0$: acute; roughly point in same direction
\item $x ^{T} y > 0$: obtuse; roughly point in opposite direction
\end{itemize}

\item Orthonormal set of vectors
\label{sec-2_2_6_3}%
\begin{itemize}
\item set of $k$ vectors $u_1, u_2, ..., u_k \in \mathbb{R}^{n}$ orthonormal; $U= [u_1 \cdots u_k]$
\item $U^T U= I_k \leftrightarrow$ set of column vectors of $U$ are orthonormal
\item ${\bf warning}$: $U U ^{T} \ne I_k$ if $k<n$

\begin{itemize}
\item say $U$ is $10\times 3$, $U^T$ is $3 \times 10$, rank of $U$ is 3 $\Rightarrow$ rank of $UU^T$ is at most 3
\item but $UU^T$ will be a $10\times 10$ matrix, so it can't be the identity matrix
\end{itemize}

\end{itemize}

\end{itemize} % ends low level
\section{Lecture 5}
\label{sec-3}

A good source for more on orthogonality at \href{http://www.math.umn.edu/~olver/aims_/qr.pdf}{University of Minnesota}
\subsection{Geometric properties of orthonormal vectors}
\label{sec-3_1}

\begin{itemize}
\item columns of $U$ are ON $\Rightarrow$ mapping under $U$ preserves distances

\begin{itemize}
\item $w=Uz \Rightarrow \|w \| = \| z \|$
\end{itemize}

\item Also preserves inner product
\item Also preserves angles
\item Something like a rigid transformation
\end{itemize}
\subsection{Orthonormal basis for $\mathbb{R}^{n}$}
\label{sec-3_2}

\begin{itemize}
\item if there are $n$ orthonormal vectors (remember, with dimension $n$), it forms an orthonormal basis for $\mathbb{R}^{n}$
\item $U^{-1}=U^T$

\begin{itemize}
\item \fbox{$U^T U=I \Leftrightarrow U$'s column vectors form an orthonormal basis for $\mathbb{R}^{n}$}
\item $\displaystyle \sum _{i=1} ^{n} u_i u_i^T = I \in \mathbb{R}^{n \times n}$ (known as a dyad, or outer product; inner products reverses the two and gives a scalar, outer gives a matrix)
\item outer products take 2 vectors, possibly of different sizes, and multiplies every combination of elements one with another
\end{itemize}

\end{itemize}
\subsection{Expansion in orthonormal basis}
\label{sec-3_3}

\begin{itemize}
\item $U$ orthogonal $\Rightarrow x=UU^T$
\item $\displaystyle x= \sum ^{n} _{i=1} \left( u ^{T} _{i} x\right) u _{i}$

\begin{itemize}
\item because $U^TU=I$, the thing in sum is really $u_i u_i^T x$
\item $u_i^T x$ is really a scalar, so this can be moved to the front of $u_i$, giving our result
\item This says $x$ is a linear combination of $u_i$'s
\end{itemize}

\end{itemize}
\subsection{Gram-Schmidt procedure}
\label{sec-3_4}

\begin{itemize}
\item $a_1, ..., a_k \in \mathbb{R}^{n}$ are LI; G-S finds ON vectors $q_1,..., q_k$ s.t. $$ {\bf span} (a_1,...,a_r)= {\bf span} (q_1,...,q_r)$$ for $r \le k$
\item so $q_1, ..., q_r$ is an ON basis for span($a_1, ...,a_r$)
\item Basic method: orthogonalize each vector wrt the previous ones, then normalize result

\begin{enumerate}
\item $\tilde q_1 = a_1$
\item normalize: $q_1 = \tilde q_1/ \|\tilde q_1 \|$
\item remove $q_1$ component from $a_2$: $\tilde q_2 = a_2 - (q_1^T a_2) q_1$
\item normalize $q_2$
\item remove $q_1, q_2$ components: $\tilde q_3= a_3 - (q_1^T a_3) q_1 - (q_2^T a_3)q_2$
\item normalize $q_3$
\end{enumerate}

\item $a_i= (q_1^T a_i) q_1 + (q_2^T a_i)q_2 + \cdots + (q_{i-1}^T a_i)q_{i-1} + \| \tilde q_i \| q_i$

\begin{itemize}
\item $= r_{1i} q_1 + r_{2i} q_2 + \cdots + r_{ii} q_i$ ($r_{ii} \ge 0$ is the length of $\tilde q_i$)
\end{itemize}

\end{itemize}
\subsection{$QR$ decomposition}
\label{sec-3_5}

This can be written as $A=QR$, where $A \in \mathbb{R}^{n \times k}, Q \in \mathbb{R}^{n \times k} , R \in \mathbb{R}^{k\times k}$

\[
\begin{bmatrix}
  a_1 & a_2 & \cdots & a_k \\
\end{bmatrix}
=
\begin{bmatrix}
  q_1 & q_2 & \cdots & q_k \\
\end{bmatrix}
\begin{bmatrix}
  r_{11} & r_{12} & \cdots & r_{1k} \\
         0 & r_{22} & \cdots & r_{2k} \\
    \vdots & \vdots   & \ddots & \vdots   \\
         0 & 0        & \cdots & r_{kk} \\
\end{bmatrix}
\]
\begin{itemize}
\item $R$ triangular because computation of $a_i$ only involves up to $q_i$

\begin{itemize}
\item a sort of causality, since you can calculate $q_7$ without seeing $q_8$
\end{itemize}

\item Columns of $Q$ are ON basis for $\mathcal{R}(A)$
\end{itemize}
\subsection{General Gram Schmidt procedure (`rank revealing QR algorithm')}
\label{sec-3_6}

\begin{itemize}
\item Basically the same, but if one of the $\tilde q_i$'s is zero (meaning $a_i$ is dependent on previous $a$ vectors), then just go to the next column
\item referring to notes, upper staircase notation shows which vectors are dependent on previous ones (columns without the x's)

\begin{itemize}
\item entries with x are `corner' entries
\end{itemize}

\end{itemize}
\subsection{Applications}
\label{sec-3_7}

\begin{itemize}
\item check if $b \in {\bf span} (a_1, a2, ..., a_k)$
\item Factorize matrix $A$
\end{itemize}
\subsection{Least Squares Approximation}
\label{sec-3_8}

\begin{itemize}
\item Overdetermined linear equation (tall, skinny, more equations than unknowns, dimensionally redundant system of equations)
\end{itemize}
\section{Lecture 6}
\label{sec-4}

On skinny, full rank matrices
\subsection{Overdetermined equations}
\label{sec-4_1}

\begin{itemize}
\item Skinny, more equations than unknowns
\item Given $y=Ax, A\in \mathbb{R}^{m\times n}$, a randomly-chosen $y$ in $\mathbb{R}^{m}$ has 0 probability of being in the range of $A$
\item To $approximately$ solve for $y$, minimize norm of error (residual) $r=Ax-y$
\item find $x=x _{ls}$ (least squares approx.) that minimizes $\|r\|$
\end{itemize}
