lin-dyn-sys-stanford.tex
\subsection{Least Squares `Solution'}
\label{sec-4_2}

\begin{itemize}
\item square $\|r\|$, get expansion, set gradient wrt $x$ equal to zero
\item \fbox{$x _{ls} = (A ^{T} A) ^{-1} A ^{T} y$ } $=B_{ls} y$ (linear operation)
\item $A ^{T} A$ should be invertible, square, full rank
\item $(A ^{T} A)^{-1} A ^{T}$ is a generalized inverse (is only inverse for square matrices, though)

\begin{itemize}
\item Also known as the $A^\dagger$, `pseudo-inverse'
\item Which is a left inverse of $A$
\end{itemize}

\end{itemize}
\subsection{Projection on $\mathcal{R}(A)$}
\label{sec-4_3}

$Ax _{ls}$ is the point closest to $y$ (i.e., projection of $y$ onto $\mathcal{R}(A)$)
\begin{itemize}
\item $A x _{ls} = {\bf proj} _{ \mathcal{R}(A)} (y)= \left(A(A ^{T} A) ^{-1} A ^{T} \right)y$
\end{itemize}
\subsection{Orthogonality principle}
\label{sec-4_4}

The optimal residual is orthogonal to $C(A)$
\begin{itemize}
\item $r = A x _{ls} -y = (A(A ^{T} A) ^{-1} A ^{T} -I)y$ orthogonal to $C(A)$
\item $\langle r, Az \rangle = y ^{T} (A(A ^{T} A) ^{-1} A ^{T} -I) ^{T} Az = 0$ for all $z \in \mathbb{R}^{n}$
\end{itemize}
\subsection{Least-squares via $QR$ factorization}
\label{sec-4_5}

$A$ is still skinny, full rank
\begin{itemize}
\item Factor as $A=QR$; $Q^TQ=I_n, R \in \mathbb{R}^{n\times n}$ upper triangular, invertible
\item pseudo-inverse: $(A ^{T} A) ^{-1} A ^{T} = R ^{-1} Q ^{T} \Rightarrow$ \fbox{$R ^{-1} Q ^{T} y = x _{ls}$}
\item Pretty straight-forward
\item Matlab for least squares approximation
\begin{verbatim}
     xl = inv(A' * A)*A'y; # So common that has shorthand in MATLAB
     xl = A\y;                 # Works for non-skinny matrices, may do unexpected things
\end{verbatim}

\end{itemize}
\subsection{Full $QR$ factorization}
\label{sec-4_6}

\begin{itemize}
\item $A= \begin{bmatrix}Q_1 & Q_2 \end{bmatrix} \begin{bmatrix} R_1 \\ 0 \end{bmatrix}$

\begin{itemize}
\item New $Q$ is square, orthogonal matrix; $R_1$ is square, upper triangular, invertible
\end{itemize}

\item Remember, multiplying by orthogonal matrix doesn't changet the norm:

\begin{itemize}
\item $\| A x-y \| ^{2} = \| R_1 x - Q ^{T} _{1} y \|^2 + \| Q ^{T} _{2} y \| ^{2}$
\item Find least squares approximation with $x _{ls} = R ^{-1} _{1} Q ^{T} _{1} y$ (zeroes first term)
\end{itemize}

\end{itemize}
\subsection{Applications for least squares approximations}
\label{sec-4_7}

\begin{itemize}
\item if there is some noise $v$ in $y = Ax+v$

\begin{itemize}
\item you can't reconstruct $x$, but you can get close with the approximation
\end{itemize}

\item Estimation: choose some $\hat x$ that minimizes $\| A \hat x - y\|$, which is the deviation between the think we observed, and what we would have observed in the absence of noise
\end{itemize}
\subsection{BLUE: Best linear unbiased estimator}
\label{sec-4_8}

\begin{itemize}
\item $A$ still full rank and skinny; have a `linear estimator' $\hat x= By$ ($B$ is fat)

\begin{itemize}
\item $\hat x = B(Ax+v)$
\end{itemize}

\item Called unbiased if there is no estimation error when there's no noise; the estimator works perfectly in the absence of noise

\begin{itemize}
\item if $v=0$ and $BA=I$; $B$ is left inverse/perfect reconstructor
\end{itemize}

\item Estimation error uf unbiased linear estimator is $x- \hat x= sBv$, so we want $B$ to be small and $BA=I$; small means error isn't sensitive to the noise
\item The pseudo-inverse is the smallest left inverse of $A$:

\begin{itemize}
\item $A ^{\dagger} = (A ^{T} A) ^{-1} A ^{T}$
\item $\displaystyle \sum _{i,j} B ^{2} _{ij} \ge \sum _{i,j} A _{ij} ^{\dagger 2}$
\end{itemize}

\end{itemize}
\subsection{Range-finding example}
\label{sec-4_9}

\begin{itemize}
\item Find ranges to 4 beacons from an unknown position $x$
\item $y = - \begin{bmatrix}
           k _{1} ^{T} \\ k _{2 } ^{T} \\ k _{3} ^{T} \\ k _{4} ^{T} 
         \end{bmatrix} x + v$
\item actual position $x=(5.59, 10.58)$; measurement $y=(-11.95, -2.84, -9.81, 2.81)$

\begin{itemize}
\item these numbers aren't consistent in $Ax=y$, since there's also the error; there is no such $x$ value that can give this $y$ value
\end{itemize}

\item There are 2 redundant sensors (2 more $y$ values than $x$ values); one method for estimating $\hat x$ is `just enough' method: you only need 2 $y$ values; take inverse of top half of $A$ and pad the rest of the matrix with 0's
\item use $\hat x = B _{just enough} y = \begin{bmatrix}\begin{bmatrix} k_1 ^{T} \\ k_2 ^{T} \end{bmatrix} ^{-1} \begin{matrix} 0 & 0 \\ 0 & 0 \end{matrix}\end{bmatrix} = \begin{bmatrix}
                                           0 & -1.0 & 0 & 0 \\ -1.12 &   .5 & 0 & 0 \\   
                                     \end{bmatrix} y = \begin{bmatrix} 2.84 \\ 11.9 \end{bmatrix}$
\item Least Squares method: $\hat x A ^{\dagger} y =$ this has a much smaller norm of error
\item Just enough estimator doesn't seem to have good performance\ldots{}unless last two measurements were really off, since JEM only takes 2 measurements into account
\end{itemize}
\subsection{Quantizer example}
\label{sec-4_10}

Super-impressive least squares estimate; more precise than A-D converter
\subsection{Least Squares data-fitting}
\label{sec-4_11}

\begin{itemize}
\item use functions $f_1, f_2, ..., f_n:S \rightarrow \mathbb{R}$ are called regressors or basis functions
\item applications

\begin{itemize}
\item interpolation- , extrapolation, smoothing of data
\end{itemize}

\end{itemize}

\begin{center}
\begin{tabular}{ll}
 Applications                    &                                                                                    \\
\hline
 interpolation                   &  don't have sensors in specific location, but want the temperature                 \\
 extrapolation                   &  get good basis functions for better interpolation                                 \\
 data smoothing                  &  de-noise measurements                                                             \\
 simple, approximate data model  &  Get a million samples, use the data-fitting to get a simple approximate function  \\
\end{tabular}
\end{center}
\subsection{Least-squares polynomial fitting}
\label{sec-4_12}

\begin{itemize}
\item Vandermonde matrix?
\end{itemize}
\section{Lecture 7}
\label{sec-5}
\subsection{Least-squares polynomial fitting, cont'd}
\label{sec-5_1}

\begin{itemize}
\item have data samples $(t_i, y_i), i=1,...,m$
\item fit coefficients $a_i$ of polynomial $p(t)= a_0 + a_1 t + \cdots + a _{n-1} t ^{t-1}$ so that when evaluated at $t_i$ it will give you the associated $y$ value
\item basis functions are $f_j(t)= t ^{j-1}, j=1,...,n$
\item use Vandermonde matrix $A$ (`polynomial evaluator matrix'):
\end{itemize}
\[
A=
\begin{bmatrix}
  1 & t_1    & t_1^2 & ... & t_1^{n-1} \\
  1 & t_2    & t_2^2 & ... & t_2^{n-1} \\
    & \vdots &       &     & \vdots    \\
  1 & t_m    & t_m^2 & ... & t_m^{n-1} \\
\end{bmatrix}
\]
\begin{itemize}
\item side note: use this when you want to fit throughout an interval, use a Taylor series fit if you want it close to a point
\end{itemize}
\subsection{Growing sets of regressors}
\label{sec-5_2}

\begin{itemize}
\item Given ordered set of vectors; find best fit with first vector, then best fit with first and second, then best fit with first three\ldots{}
\item These vectors called \emph{regressors}, or columns
\item Say you have some \emph{master list} $A$ with $n$ columns, and $A ^{(p)}$ will be the matrix with the first $p$ columns of it

\begin{itemize}
\item we want to minimize different sets of $\| A ^{(p)} x-y \|$
\item i.e., project $y$ onto a growing span $\{a_1, a_2, ..., a_p\}$
\end{itemize}

\item Solution for each $p \le n$ given by $x _{ls} ^{(p)} = (A ^{T} _{p} A _{p} )^{-1} A _{p} ^{T} y = R ^{-1} _{p} Q ^{T} _{p} y$

\begin{itemize}
\item In MATLAB, \texttt{A(:,1:p)\textbackslash{}y}, though technically it's faster to do a sort of \texttt{for} loop
\end{itemize}

\item Residual, $\| \sum ^{p} _{i=1} x_i a_i -y \|$ reduces as $p$ (number of columns) increases

\begin{itemize}
\item though it may be same as residual with previous value of $p$ if the optimal $x_1=0$, when $y \perp a_1$
\item if the residual drops 15\% from that of previous value of $p$, you say that $a_1$ explains 15\% of $y$
\end{itemize}

\end{itemize}
