lin-dyn-sys-stanford.tex
\subsection{Least-squares system identification (important topic)}
\label{sec-5_3}

\begin{itemize}
\item measure input, output $u(t), y(t)$ for $t=0,...,N$ of unknown system, and try to get a model of system
\item example: moving average (MA) model with $n$ delays (try to approximate what are the weights $h_i$ for each delay)

\begin{itemize}
\item see equation/matrix in notes, though there are different ways to write it
\item get best answer with LSA
\end{itemize}

\end{itemize}
\subsection{Model order selection}
\label{sec-5_4}

\begin{itemize}
\item how large should $n$ be?
\item the larger, the smaller prediction error on \emph{data used to form model}
\item but at a certain point, predictive ability of model on other I/O data from same system worsens
\item probably best to choose the `knee' on the graph on notes slide for prediction of new data
\end{itemize}
\subsubsection{Cross-validation}
\label{sec-5_4_1}

\begin{itemize}
\item check with new data, only if you're getting small residuals on data you've already seen
\item when $n$ gets too large (greater than $n=10$ on graph), the error with `validation data' actually gets larger
\item this example is ideal, since $n=10$ is the obvious order for the model
\item \textbf{Application note}: in medical, many industries, there's a firm wall between validation data and model-developing data, so someone \emph{else} tests your model
\item in this example, it is known as \emph{overfit} when the validation data error gets larger for $n$ too large
\end{itemize}
\subsection{Growing sets of measurements}
\label{sec-5_5}

\begin{itemize}
\item similar to GSo Regressors, except you add new rows, not columns
\item this would happen if we're estimating a parameter $x$ (which is constant)
\item Solution: $\displaystyle x_{ls} = \left( \sum ^{m} _{i=1} a_i a_i ^{T} \right) ^{-1} \sum ^{m} _{i=1} y_i a_i$
\item new way to think of least squares equation
\end{itemize}
\subsection{Recursive ways to do least squares}
\label{sec-5_6}

\begin{itemize}
\item don't have to re-add for each new measurement

\begin{itemize}
\item i.e., memory is bounded
\item use equation from notes; solution is $x _{ls} (m) = P(m) ^{-1} q(m)$
\end{itemize}

\end{itemize}
\subsection{Fast update algorithm for recursive LS}
\label{sec-5_7}

\begin{itemize}
\item Was a big deal back in the day; somewhat still
\end{itemize}
\subsection{Multi-objective least squares}
\label{sec-5_8}

\begin{itemize}
\item Sometimes you have 2+ objectives to minimize

\begin{itemize}
\item say $J_1 = \| Ax-y\| ^{2}$ (what we've done so far)
\item and $J_2 = \| Fx-g\| ^{2}$
\item these are usually competing (minimize one at cost of other)
\end{itemize}

\item Variable in question is $x \in \mathbb{R}^{n}$
\item Plot in notes shows plot of $(J_1(x_i), J_2(x_i))$
\item Some points are unambiguously worse than others, but there is some ambiguity when $J_1(x_1) < J_1(x_2)$, while $J_2(x_1) > J_2(x_2)$
\item Fix this ambiguity with `weighted-sum objective'
\item $J_1 + \mu J_2 = \| Ax-y\| ^{2} + \mu \| Fx-g\| ^{2}$

\begin{itemize}
\item Say, there's a trade-off between smoothness (no noise) and better fit; $\mu$ can have different dimensions if $J_2$ does
\end{itemize}

\item Use slope of $\mu$ in graph (`indifference curve', in economics) [slide 7-6]
\end{itemize}
\section{Lecture 8}
\label{sec-6}

Multi-objective least-squares
\subsection{Plot of achievable objective pairs}
\label{sec-6_1}

\begin{itemize}
\item if it approximates an L shape (has a `knee'), the knee is usually the obvious optimal location, so least-squares isn't as helpful

\begin{itemize}
\item optimal point isn't very sensitive to $\mu$
\end{itemize}

\item Other extreme: trade-off curve looks linear (negative slope), where it's zero-sum

\begin{itemize}
\item optimal point very sensitive to $\mu$
\item slope commonly called \emph{exchange rate curve}
\end{itemize}

\item In this class, they must be convex curves (cup up/outward)
\item To find Pareto optimal points, minimize $J_1 + \mu J_2 = \alpha$

\begin{itemize}
\item on plot, can have level curves with slope $\mu$
\item Find point on Pareto Optimal Curve that has slope $\mu$
\end{itemize}

\end{itemize}
\subsection{Minimizing weighted-sum objective}
\label{sec-6_2}

\begin{itemize}
\item note: norm-squared of a stacked vector is norm-square of the top+norm-square of bottom
\end{itemize}
$$J_1+\mu J_2 = \| Ax - y \| ^{2} + \mu \| Fx - g \| ^{2} = \left\|
\begin{bmatrix}
  A           \\
  \sqrt \mu F \\
\end{bmatrix}
x-
\begin{bmatrix}
  y \\
  \sqrt \mu g \\
\end{bmatrix}
\right\| ^{2} 
$$
\[
= \left\| \tilde Ax- \tilde y \right\|
\]
where
\[
\tilde A =
\begin{bmatrix}
  A           \\
  \sqrt \mu F \\
\end{bmatrix}
, \tilde y =
\begin{bmatrix}
  y \\
  \sqrt \mu g \\
\end{bmatrix}
\]
If $\tilde A$ is full rank,
\begin{eqnarray}
x &=& \left( \tilde A ^{T} \tilde A \right)^{-1} \tilde A ^{T} \tilde y \\
  &=& ( A ^{T} A + \mu F ^{T} F) ^{-1} (A ^{T} y + \mu F ^{T} g)
\end{eqnarray}
Note: to plot the tradeoff curve, calculate the minimizer $x_\mu$, and plot the resulting pairs $(J_1, J_2)$ 
In MATLAB, \texttt{[A; sqrt(mu) * F]\textbackslash{}[y;sqrt(mu) * g]}
\subsection{Example: frictionless table}
\label{sec-6_3}

\begin{itemize}
\item $y$ is final position at $t=10$; $y=a ^{T} x$, $a\in \mathbb{R}^{10}$
\item $J_1 = (y-1) ^{2}$, (final position difference from $y=1$ squared)
\item $J_2 = \|x\| ^{2}$ sum of force squares
\item Q: Why do we often care about sum of squares? A: \textbf{It's easy to analyze} (not necessarily because it corresponds to energy)

\begin{itemize}
\item max $| x_i |$ corresponds to maximum thrust
\item $\sum |x_i|$ corresponds to fuel use
\end{itemize}

\item Optimal tradeoff curve is quadratic
\end{itemize}
\subsection{Regularized least-squares}
\label{sec-6_4}

\begin{itemize}
\item famous example of multi-objective least squares

\begin{itemize}
\item second $J$ term is simply $J_2 = \|x\|$, though first is the same: $J_1 = \|Ax-y\| ^{2}$
\end{itemize}

\item Tychonov regularization works for \emph{any} $A$

\begin{itemize}
\item \emph{regularized} least-squares solution: \fbox{$x_\mu = (A ^{T} A + \mu I) ^{-1} A ^{T} y$}, for $F=I, g=0$
\end{itemize}

\end{itemize}
Show $(A ^{T} A + \mu I)$ is invertible, no matter what size/values of $A$ (assuming $\mu > 0$ ): 
If this is \emph{not} invertible (singular), it means some nonzero vector $z$ gets mapped to zero ($z \in \mathcal{N}(A)$)
\begin{eqnarray}
(A ^{T} A + \mu I) z= 0, z \ne 0 \\
z ^{T} (A ^{T} A + \mu I) z = 0 \text{ since } z^T \vec{0} =0 \\
z ^{T} A ^{T} A z + \mu z ^{T} z = 0 \\
\| A z \| ^{2} + \mu \| z \| ^{2} = 0 \\
z = \vec{0} 
\end{eqnarray}
So, $z$ can only be zero, meaning $\mathcal{N}(A) = \{0\} \Rightarrow (A ^{T} A -\mu I)$ is invertible. This is also why $\mu$ must be positive.
Or, you know it's invertible, since it is full rank (and skinny) when you stack $\mu I$ below it (see definition of $\tilde A$).
\begin{itemize}
\item Application of Regularized least-squares

\begin{itemize}
\item estimation/inversion
\item $Ax-y$ is sensor residual
\item prior information that $x$ is really small
\item or, model only accurate for small $x$
\item Tychonov solution trades off sensor fit and size of $x$
\end{itemize}

\item Image processing example

\begin{itemize}
\item Laplacian regularization

\begin{itemize}
\item image reconstruction problem
\end{itemize}

\item $x$ is vectorized version of image
\item $\|A x - y\| ^{2}$ is difference from real image
\item Want new objective to minimize roughness

\begin{itemize}
\item vector $Dx$ (from new matrix $D$) which has difference between neighboring pixels as elements

\begin{itemize}
\item $D_v x$ measures vertical difference
\item $D_h x$ measures horizontal difference
\item Nullspace is vector where there is no variation between pixels
\end{itemize}

\end{itemize}

\item minimize $\|A x-y\| ^{2} + \mu \| [D_h x \; D_v x]^{T} \| ^{2}$

\begin{itemize}
\item if $\mu$ is turned way up, it'll be all smoothed out
\item if you care about total size of image, you can add another parameter $\lambda$: $\|A x-y\| ^{2} + \mu \| [D_h x \; D_v x]^{T} \| ^{2} + \lambda \|x\| ^{2}$
\end{itemize}

\end{itemize}

\end{itemize}
\subsection{Nonlinear least squares (NLLS) problem}
\label{sec-6_5}

\begin{itemize}
\item find $x\in \mathbb{R}^{n}$ that minimizes $\displaystyle \| r(x) \| ^{2} = \sum ^{m} _{i=1} r _{i} (x) ^{2}$
\item $r(x)$ is vector of residuals; $r(x)= Ax-y \Rightarrow$ problem reduces to linear least squares problem
\item in general, can't \textbf{really} solve a NLLS problem, but can find good heuristics to get a locally optimal solution
\end{itemize}
