lin-dyn-sys-stanford.tex
\subsection{Gauss-Newton method for NLLS}
\label{sec-6_6}

\begin{itemize}
\item Start guess for $x$
\item Loop

\begin{itemize}
\item linearize $r$ near current guess
\item new guess is linear LS solution, using linearized $r$
\item if convergence, stop
\end{itemize}

\item Linearize?

\begin{itemize}
\item Jacobian: $(Dr) _{ij} = \partial r _{i} / \partial x_j$
\item Linearization: $r (x) \approx r(x ^{(k)}) + Dr(x ^{(k)} ) (x-x ^{(k)} )$
\item Set this linearized approximation equal to $r(x) \approx A ^{(k)} x-b ^{(k)}$

\begin{itemize}
\item $A ^{(k)} = Dr(x ^{(k)})$
\item $b ^{(k)} = Dr (x ^{(k)}) x ^{(k)} -r(x ^{(k)})$
\end{itemize}

\item See rest in notes
\item At $k$ th iteration, approximate NLLS problem by linear LS problem:

\begin{itemize}
\item $\| r (x) \| ^{2} \approx \left\| A ^{(k)} x-b ^{(k)} \right\| ^{2}$

\begin{itemize}
\item if you wanna make this really cool add a $\mu \|x-x ^{(k)} \| ^{2}$ term on RHS
\item called a `trust region term';
\item first (original) part says to minimize sum of squares for \emph{model}
\item trust region term says `but don't go far from where you are now'
\end{itemize}

\end{itemize}

\end{itemize}

\item Could also linearize without calculus; works really well

\begin{itemize}
\item See `particle filter'
\end{itemize}

\end{itemize}
\subsection{G-N example}
\label{sec-6_7}

\begin{itemize}
\item Nice graph and residual plot
\item As practical matter, good to run simulation several times (with different initial guesses)
\item `exuastive simulation'
\end{itemize}
\subsection{Underdetermined linear equations}
\label{sec-6_8}

\begin{itemize}
\item $A \in \mathbb{R}^{m \times n}, m<n$ ($A$ is fat)
\item more variables than equations
\item $x$ is underspecified
\item For this sectian \textbf{assume $A$ is full rank}
\item Set of all solutions has form $\{x | Ax=y\} = \{x_p + z | z \in \mathcal{N}(A) \}$
\item solution has dim $\mathcal{N}(A)= n-m$ `degrees of freedom'

\begin{itemize}
\item many DOF: good for design (flexibility), bad for estimation (stuff you don't/can't know with available measurements)
\end{itemize}

\end{itemize}
\subsection{Least norm solution}
\label{sec-6_9}

\begin{itemize}
\item \fbox{$x _{ls} = A ^{T} (AA ^{T}) ^{-1} y$}

\begin{itemize}
\item similar to our familiar skinny $A$ version: $x _{ls} = (A^{T} A) ^{-1} A ^{T} y$
\item mnemonic: $(\cdot) ^{-1}$ thing must be square

\begin{itemize}
\item if $A$ skinny, both \$A A $^{T}$ and \$ $A^TA$ could be square (syntactically)
\item semantically, you need the up and down patterns that will form the smallest square, i.e., full rank matrix
\end{itemize}

\end{itemize}

\end{itemize}
\section{Lecture 9 pt 2}
\label{sec-7}

Thank you fucking Suncheon.
\subsection{General norm minimization with equality constraints}
\label{sec-7_1}

\begin{itemize}
\item Problem: \fbox{minimize $\|A x-b\|$ subject to $Cx=d$, with variable $x$}
\item Least squares/least norm are special cases

\begin{itemize}
\item Least norm: set $A=I, b=0$, then you just have norm of $x$ subject to some linear equations
\end{itemize}

\item Same as: minimize $(1/2) \|Ax-b\| ^{2}$ subject to $Cx=d$
\item Lagrangian is\ldots{}long ugly thing\ldots{}look at notes

\begin{itemize}
\item a bit easier to look at block matrix format
\end{itemize}

\end{itemize}
$$
\begin{bmatrix}
  A ^{T} A & C ^{T} \\
  C        & 0      \\
\end{bmatrix}
\begin{bmatrix}
  x       \\
  \lambda \\
\end{bmatrix}
=
\begin{bmatrix}
  A ^{T} b \\
  d        \\
\end{bmatrix}
$$
\begin{itemize}
\item recover least squares (maybe) by eliminating $C$ from matrix (not setting to zero, but only having 1 row/column in first matrix)
\end{itemize}
\subsection{Autonomous linear dynamical systems}
\label{sec-7_2}

``What the class is nominally about''
\begin{itemize}
\item In continuous time, autonomous LDS has form $\dot x = Ax$
\item Solution: $x(t) = e ^{ta} x(0)$
\item $x(t) \in \mathbb{R}^{n}$ is called the state

\begin{itemize}
\item $n$ is state dimension
\end{itemize}

\item $A$ basically maps where you are ($x$) to where you're going ($\dot x$)

\begin{itemize}
\item has units of s$^{-1}$, frequency
\end{itemize}

\item Example illustration: vector fields
\end{itemize}
\subsection{Block diagrams}
\label{sec-7_3}

\begin{itemize}
\item use integrators to express $\dot x =Ax$ instead of differentiators

\begin{itemize}
\item block called `bank of integrators'
\item historically used because of analog, mechanical computers
\end{itemize}

\item notches to express $n$ signals
\end{itemize}
\subsection{Linear circuit example}
\label{sec-7_4}
\section{Lecture 10}
\label{sec-8}

Examples of autonomous linear dynamical systems, $\dot x = Ax$ 
\subsection{Example: Series reaction $A \rightarrow B \rightarrow C$}
\label{sec-8_1}

$$
\dot x=
\begin{bmatrix}
  -k_1 & 0    & 0 \\
  k_1  & -k_2 & 0 \\
  0    & k_2  & 0 \\
\end{bmatrix}
x
$$
\begin{itemize}
\item For second row, first term on rhs of $\dot x_2 = k_1 x_1 - k_2 x_1$ is \emph{buildup}
\item Note: Column sums are 0 implies conservation of mass/materials;
\end{itemize}
\subsection{Discrete time Markov chain}
\label{sec-8_2}

\begin{itemize}
\item $x(t+1) = Ax(t)$
\item $x(t) = A ^{t} x(0)$
\item Given current state, the matrix of \emph{transition probabilities} $P$ will tell you probabilities of the next state, given the current state
\end{itemize}
\subsection{Numerical integration of continuous system}
\label{sec-8_3}

\begin{itemize}
\item for a small time step $h$, find about where you'll be in $h$ seconds b
\item $x(t+h) \approx x(t) + h \dot x(t) = (I + hA) x(t)$
\item problem: when you do it for a long time, error can build up pretty high
\end{itemize}
\subsection{Higher order linear dynamical systems ($\dot x=Ax$)}
\label{sec-8_4}

$x ^{(k)} = A _{k-1} x ^{(k-1)} + \cdots + A _{1} x ^{(1)} + A _{0} x, x(t) \in \mathbb{R}^{n}$
\begin{itemize}
\item define new variable
\end{itemize}
$$
z =
\begin{bmatrix}
  x          \\
  x ^{(1)}   \\
  \vdots     \\
  x ^{(k-1)} \\
\end{bmatrix}
\in \mathbb{R}^{nk},
\dot z =
\begin{bmatrix}
  x ^{(1)}   \\
  \vdots     \\
  x ^{(k)} \\
\end{bmatrix}
=
\begin{bmatrix}
       0 &   I &   0 & \cdots & 0        \\
       0 &   0 &   I & \cdots & 0        \\
  \vdots &     &     &        & \vdots   \\
       0 &   0 &   0 & \cdots & I        \\
     A_0 & A_1 & A_2 & \cdots & A _{k-1} \\
\end{bmatrix}
z
$$
\begin{itemize}
\item `upshift $x$, and zero-pad'
\item $z$ is the state, not $x$
\item in notes, black diagram with chain of integrators
\end{itemize}
\subsection{Example: Mechanical systems}
\label{sec-8_5}

\begin{itemize}
\item Ex: $K _{12}$ is `cross-stiffness', how much stiffness you'd feel at node 1 from node 2
\end{itemize}
\subsection{Linearization near equilibrium point}
\label{sec-8_6}

Equilibrium point corresponds to constant solution ($f(x_e)= 0, x(t)=x_e$)
\begin{itemize}
\item if you start at an equilibrium point, you'll stay there
\item if you start \emph{near} equilibrium point

\begin{itemize}
\item veer off (unstable)
\item go towards equilibrium (stable)
\item something in between
\end{itemize}

\item but, you never stay at an unstable equilibrium position, since equation is really $\dot x = f(x) + w(t)$, where $w(t)$ is noise
\item Near equilibrium point, $\dot{\delta x}(t) \approx Df(x_e) \delta x(t)$, where $D$ is the Jacobian

\begin{itemize}
\item similar to euler forward equation
\end{itemize}

\item Don't fully trust approximations on approximations (but hope they work)
\end{itemize}
\subsection{Example: pendulum linearization}
\label{sec-8_7}

\begin{itemize}
\item $ml ^{2} \ddot{\theta}=-lmg \sin \theta$
\item rewrite as 1st order DE with state $x=[\theta \; \dot \theta] ^{T} = [x_1 \; x_2] ^{T}$:
\end{itemize}
$$
\dot x =
\begin{bmatrix}
  x _{2}          \\
  -(g/l) \sin x_1 \\
\end{bmatrix}
$$ 
\begin{itemize}
\item $\exists$ equilibrium point at $x=0$ (and $\pi$), so we linearize system near $x _{e} =0$, using a Jacobian matrix:
\end{itemize}
$$
\dot{\delta x}=
\begin{bmatrix}
  \frac{\partial x_2}{\partial x_1}               & \frac{\partial x_2}{\partial x_2}               \\
  \frac{\partial}{\partial x_1} \left(-(g/l) \sin x_1 \right)|_{x_1=0} & \frac{\partial}{\partial x_2} (-(g/l) \sin x_1) \\
\end{bmatrix}
\delta x  
=
\begin{bmatrix}
     0 & 1 \\
  -g/l & 0 \\
\end{bmatrix}
\delta x  
$$
\section{Lecture 11}
\label{sec-9}

Solution via Laplace transform and matrix exponential
Remember, we've already overloaded $\dot x =ax$. Now, we'll overload exponentials to apply to matrices $x(t) = e ^{ta} x(0)$.
