lin-dyn-sys-stanford.org
** Laplace transform
- $z: \mathbb{R} _{+} \rightarrow \mathbb{R}^{p\times q}$ (function that maps non-negative real scalars to matrices)
- Laplace transform: $Z= \mathcal{L}(z)$, defined by $\displaystyle Z(s) = \int _{0} ^{\infty} e ^{-st} z(t) dt$
- Region of convergence of $Z$ is mostly for confusing students
- Derivative property: $\mathcal{L}(\dot z) = sZ(s)-z(0)$
So, we can use the Laplace transform to solve $\dot x=Ax$. Take Laplace: $sX(s)-x(0)=AX(s)$, rewrite as $(sI-A)X(s) = x(0)$, so $X(s) = (sI-A) ^{-1} x(0)$. Then take the inverse transform: \fbox{$x(t) = \mathcal{L} ^{-1} \left( (sI-A) ^{-1} \right) x(0)$}
- takes advantage if linearity of the Laplace transform
- $(sI-A) ^{-1}$ is called the /resolvent/ of $A$
  - but not defined for eigenvalues of $A$; $s$, ST det($sI-A$)=0
- \fbox{$\Phi = \mathcal{L} ^{-1} ((sI-A) ^{-1} )$ } is called the /state-transition matrix/, which maps the initial state to state at time $t$: \fbox{$x(t) = \Phi(t)x(0)$ }
** Example: Harmonic oscillator
$$
\dot x =
\begin{bmatrix}
   0 & 1 \\
  -1 & 0 \\
\end{bmatrix}
x
$$ 
- To solve for $s$, get the resolvent, then apply the Laplacion to it /elementwise/, getting
$$
x(t) =
\begin{bmatrix}
  \cos t  & \sin t \\
  -\sin t & \cos t \\
\end{bmatrix}
x(0)
$$
Which is a circular rotation matrix. The solutions to $\dot x = ax$ is $x(t) = e ^{ta} x(0)$
- $a$ positive: exponential growth
- $a$ negative: exponential decay
- $a=0$: constant
** Example: Double Integrator
- Note, with scalars, $x$ in $\dot x=ax$ grows exponentially in time, and cannot grow linearly, as with matrices (can have a $t$ element in matrix)
- What is first column of $\Phi(t)$ say? It tells what the state trajectory is if the initial condition was $e_1$ (second column tells what it is if $x(0)= e_2$)
- First row says the linear combination that $x_1$ is at time $t$ given $x(0)$
** Characteristic polynomial
$\mathcal X(s) = {\bf det} (sI-A)$; called a /monic/ polynomial
- roots of $\mathcal X$ are eigenvalues of $A$, and $\mathcal X$ has real coefficients, so e-values are real or occur in conjugate pairs
** Get eigenvalues of $A$ and poles of resolvent
Use Cramer's rule to get $i,j$ entry:
$$
(-1) ^{i+j} \frac{\text{det} \Delta _{ij}}{\text{det}(sI-A)},
$$
where $\Delta _{ij}$ is $sI-A$ with $j$ th row and $i$ th column deleted. Poles of entries of resolvent *must* be eigenvalues of $A$.
** Matrix exponential
How to overload exponentials for matrices; start with $(I-C) ^{-1}= I + C + C ^{2} +$ ... Series converges if |eigenvalues of $C$ |<1.
Do series expansion of resolvent, then take the Laplacian of the series, which looks like the form for the expansion of $e ^{ta}$ (though square matrices replace scalars). So we end by learning that the state transition matrix, $\Phi(t)$ is the matrix exponential $e ^{tA}$.
- Many scalar exponential properties don't extend to matrix exponential; with scalars, this is wrong: $e ^{A+B} = e ^{A} e ^{B}$ (unless $A$ and $B$ commute: $AB=BA$)
- But this is ok: $e ^{-A} = (e ^{A} ) ^{-1}$
- So, how do you find the matrix exponential:
Find $e^A$,
$$
A=
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
$$ 
Found $e ^{tA} = \mathcal L ^{-1} (sI-A) ^{-1}$ in earlier example, so just plug in $t=1$.
- Matlab: =expm(A)=, not elementwise =exp(A)=
** Time transfer property
Summary: for $\dot x = Ax$, $x(t) = \Phi (t)x(0) =$ \fbox{$e ^{tA} x(0)$}. \fbox{The matrix $e ^{tA}$ propagates initial condition into state at time $t$.} Also propagates backward in time if $t<0$.

If given $x(12)$, find $x(0)$ via $e ^{-12A} x(12)$.
- Can use first order forward Euler approximate state update for small $t$
- Discretized autonomous LDS: $z(k+1) = e ^{hA} z(k)$ (not an approximation for these equations)

** Application: sampling a continuous time system
* Lecture 12
Piecewise constant system: $A$ is constant for certain intervals of time.
- Qualitative behavior of $x(t)$
  - Eigenvalues determine (possible) behavior of $x$
  - Can plot eigenvalues on complex axes; like pole plot
  - Can put $x$ in summation form with polynomial coefficient and exponential terms
** Stability
- $\dot x=Ax$ is stable if $e ^{tA} \rightarrow 0$ as $t \rightarrow \infty$
  - means that state $x(t)$ converges to 0 as $t \rightarrow \infty$, no matter $x(0)$
  - all trajectories of $\dot x = Ax$ converge to 0 as $t \rightarrow \infty$
  - $\dot x=Ax$ is stable iff all eigenvalues of $A$ have negative real part
** Eigenvectors and diagonalization
- $\lambda \in \mathbb C$ is an eigenvalue of $A \in \mathbb C ^{n\times n}$ if (characteristic polynomial)
$$
\mathcal X(\lambda) = \text{det}(\lambda I-A) = 0
$$
- i.e., $(\lambda I-A)$ is singular, not invertible, $\mathcal{N}$ not equal to the 0 set
Equivalent to:
- \exists nonzero $v \in \mathbb C ^{n}$ s.t. $(\lambda I -A) v = 0$: \fbox{$Av=\lambda v$} ($v$ is the eigenvector)
  - columns are dependent
- \exists nonzero $w \in \mathbb C ^{n}$ s.t. $w ^{T} (\lambda I -A) = 0$: \fbox{$w^T A=\lambda w ^{T}$} ($w$ is the /left eigenvector/)
  - rows are dependent
- real $A$ can still have complex e-pairs
- $A,\lambda$ real \Rightarrow \lambda is associated with a real $v$
- conjugate (negate imaginary term of complex number[s])
- hermitian conjugate (and transpose)
** Scaling intepretation
$Av$ is simply scaled version of $v$ (\lambda times); all components get magnified by the same amount
** Dynamic intepretation
For $Av=\lambda v$, if $\dot x= Ax,x(0)=v$ \Rightarrow \fbox{$x(t) = e ^{\lambda t} v$} $= e ^{tA} v$.
- $A ^{2} v = \lambda ^{2} v$
- So you just need a scalar in front of the $v$ to calculate $x(t)!$
- \fbox{An eigenvector is an initial condition $x(0)$ for which the entire trajectory is really simple.}
- solution $x(t) = e ^{\lambda t} v$ is a mode of $\dot x=Ax$ (associated with eigenvalue \lambda)
** Invariant set
a set $S \subseteq \mathbb{R}^{n}$ is /invariant/ under $\dot x = Ax$ if whenever $x(t) \in S$, then $x(\tau) \in S$ for all $\tau \ge t$ (you stay stuck within the set)
- vector field intepretation: trajectories only cut /into/ $S$
If a single point is an invariant set, it must be in the nullspace; $S=\{x_0\} \Leftrightarrow x_0 \in \mathcal{N}(A)$, so $Ax_0=0=\dot x$.
- line $\{tv | t \in \mathbb{R}\}$ is invariant for eigenvector $v$
** Complex eigenvectors
- for $a \in \mathbb C$, complex trajectory $a e ^{\lambda t} v$ satisfies $\dot x = Ax$, as well as /real/ part
$$
x(t) = \text{Re}(ae ^{\lambda t} v)
$$
$$
= e ^{\sigma t}
\begin{bmatrix}
  v _{re} & v _{im} \\
\end{bmatrix}
\begin{bmatrix}
  \cos \omega t  & \sin \omega t \\
  -\sin \omega t & \cos \omega t \\
\end{bmatrix}
\begin{bmatrix}
  \alpha \\
  -\beta \\
\end{bmatrix}
$$ 
where
$$
v= v _{re} + jv _{im} , \lambda = \sigma + j \omega, a = \alpha + j \beta
$$ 
- \sigma gives logarithmic growth/decay factor
- \omega gives angular velocity of rotation in plane
- trajectory stays in /invariant plane/ span $\{v _{re} ,v _{im}\}$
** Dynamic interpretation: left eigenvectors
** Summary:
- /right eigenvectors/ are initial conditions from which resulting motion is simple (i.e., remains on line or in plane)
- /left eigenvectors/ give linear functions of state that are simple, for any initial condition
