lin-dyn-sys-stanford.tex
\subsection{Laplace transform}
\label{sec-9_1}

\begin{itemize}
\item $z: \mathbb{R} _{+} \rightarrow \mathbb{R}^{p\times q}$ (function that maps non-negative real scalars to matrices)
\item Laplace transform: $Z= \mathcal{L}(z)$, defined by $\displaystyle Z(s) = \int _{0} ^{\infty} e ^{-st} z(t) dt$
\item Region of convergence of $Z$ is mostly for confusing students
\item Derivative property: $\mathcal{L}(\dot z) = sZ(s)-z(0)$
\end{itemize}
So, we can use the Laplace transform to solve $\dot x=Ax$. Take Laplace: $sX(s)-x(0)=AX(s)$, rewrite as $(sI-A)X(s) = x(0)$, so $X(s) = (sI-A) ^{-1} x(0)$. Then take the inverse transform: \fbox{$x(t) = \mathcal{L} ^{-1} \left( (sI-A) ^{-1} \right) x(0)$}
\begin{itemize}
\item takes advantage if linearity of the Laplace transform
\item $(sI-A) ^{-1}$ is called the \emph{resolvent} of $A$

\begin{itemize}
\item but not defined for eigenvalues of $A$; $s$, ST det($sI-A$)=0
\end{itemize}

\item \fbox{$\Phi = \mathcal{L} ^{-1} ((sI-A) ^{-1} )$ } is called the \emph{state-transition matrix}, which maps the initial state to state at time $t$: \fbox{$x(t) = \Phi(t)x(0)$ }
\end{itemize}
\subsection{Example: Harmonic oscillator}
\label{sec-9_2}

$$
\dot x =
\begin{bmatrix}
   0 & 1 \\
  -1 & 0 \\
\end{bmatrix}
x
$$ 
\begin{itemize}
\item To solve for $s$, get the resolvent, then apply the Laplacion to it \emph{elementwise}, getting
\end{itemize}
$$
x(t) =
\begin{bmatrix}
  \cos t  & \sin t \\
  -\sin t & \cos t \\
\end{bmatrix}
x(0)
$$
Which is a circular rotation matrix. The solutions to $\dot x = ax$ is $x(t) = e ^{ta} x(0)$
\begin{itemize}
\item $a$ positive: exponential growth
\item $a$ negative: exponential decay
\item $a=0$: constant
\end{itemize}
\subsection{Example: Double Integrator}
\label{sec-9_3}

\begin{itemize}
\item Note, with scalars, $x$ in $\dot x=ax$ grows exponentially in time, and cannot grow linearly, as with matrices (can have a $t$ element in matrix)
\item What is first column of $\Phi(t)$ say? It tells what the state trajectory is if the initial condition was $e_1$ (second column tells what it is if $x(0)= e_2$)
\item First row says the linear combination that $x_1$ is at time $t$ given $x(0)$
\end{itemize}
\subsection{Characteristic polynomial}
\label{sec-9_4}

$\mathcal X(s) = {\bf det} (sI-A)$; called a \emph{monic} polynomial
\begin{itemize}
\item roots of $\mathcal X$ are eigenvalues of $A$, and $\mathcal X$ has real coefficients, so e-values are real or occur in conjugate pairs
\end{itemize}
\subsection{Get eigenvalues of $A$ and poles of resolvent}
\label{sec-9_5}

Use Cramer's rule to get $i,j$ entry:
$$
(-1) ^{i+j} \frac{\text{det} \Delta _{ij}}{\text{det}(sI-A)},
$$
where $\Delta _{ij}$ is $sI-A$ with $j$ th row and $i$ th column deleted. Poles of entries of resolvent \textbf{must} be eigenvalues of $A$.
\subsection{Matrix exponential}
\label{sec-9_6}

How to overload exponentials for matrices; start with $(I-C) ^{-1}= I + C + C ^{2} +$ \ldots{} Series converges if |eigenvalues of $C$ |<1.
Do series expansion of resolvent, then take the Laplacian of the series, which looks like the form for the expansion of $e ^{ta}$ (though square matrices replace scalars). So we end by learning that the state transition matrix, $\Phi(t)$ is the matrix exponential $e ^{tA}$.
\begin{itemize}
\item Many scalar exponential properties don't extend to matrix exponential; with scalars, this is wrong: $e ^{A+B} = e ^{A} e ^{B}$ (unless $A$ and $B$ commute: $AB=BA$)
\item But this is ok: $e ^{-A} = (e ^{A} ) ^{-1}$
\item So, how do you find the matrix exponential:
\end{itemize}
Find $e^A$,
$$
A=
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
$$ 
Found $e ^{tA} = \mathcal L ^{-1} (sI-A) ^{-1}$ in earlier example, so just plug in $t=1$.
\begin{itemize}
\item Matlab: \texttt{expm(A)}, not elementwise \texttt{exp(A)}
\end{itemize}
\subsection{Time transfer property}
\label{sec-9_7}

Summary: for $\dot x = Ax$, $x(t) = \Phi (t)x(0) =$ \fbox{$e ^{tA} x(0)$}. \fbox{The matrix $e ^{tA}$ propagates initial condition into state at time $t$.} Also propagates backward in time if $t<0$.

If given $x(12)$, find $x(0)$ via $e ^{-12A} x(12)$.
\begin{itemize}
\item Can use first order forward Euler approximate state update for small $t$
\item Discretized autonomous LDS: $z(k+1) = e ^{hA} z(k)$ (not an approximation for these equations)
\end{itemize}
\subsection{Application: sampling a continuous time system}
\label{sec-9_8}
\section{Lecture 12}
\label{sec-10}

Piecewise constant system: $A$ is constant for certain intervals of time.
\begin{itemize}
\item Qualitative behavior of $x(t)$

\begin{itemize}
\item Eigenvalues determine (possible) behavior of $x$
\item Can plot eigenvalues on complex axes; like pole plot
\item Can put $x$ in summation form with polynomial coefficient and exponential terms
\end{itemize}

\end{itemize}
\subsection{Stability}
\label{sec-10_1}

\begin{itemize}
\item $\dot x=Ax$ is stable if $e ^{tA} \rightarrow 0$ as $t \rightarrow \infty$

\begin{itemize}
\item means that state $x(t)$ converges to 0 as $t \rightarrow \infty$, no matter $x(0)$
\item all trajectories of $\dot x = Ax$ converge to 0 as $t \rightarrow \infty$
\item $\dot x=Ax$ is stable iff all eigenvalues of $A$ have negative real part
\end{itemize}

\end{itemize}
\subsection{Eigenvectors and diagonalization}
\label{sec-10_2}

\begin{itemize}
\item $\lambda \in \mathbb C$ is an eigenvalue of $A \in \mathbb C ^{n\times n}$ if (characteristic polynomial)
\end{itemize}
$$
\mathcal X(\lambda) = \text{det}(\lambda I-A) = 0
$$
\begin{itemize}
\item i.e., $(\lambda I-A)$ is singular, not invertible, $\mathcal{N}$ not equal to the 0 set
\end{itemize}
Equivalent to:
\begin{itemize}
\item $\exists$ nonzero $v \in \mathbb C ^{n}$ s.t. $(\lambda I -A) v = 0$: \fbox{$Av=\lambda v$} ($v$ is the eigenvector)

\begin{itemize}
\item columns are dependent
\end{itemize}

\item $\exists$ nonzero $w \in \mathbb C ^{n}$ s.t. $w ^{T} (\lambda I -A) = 0$: \fbox{$w^T A=\lambda w ^{T}$} ($w$ is the \emph{left eigenvector})

\begin{itemize}
\item rows are dependent
\end{itemize}

\item real $A$ can still have complex e-pairs
\item $A,\lambda$ real $\Rightarrow$ $\lambda$ is associated with a real $v$
\item conjugate (negate imaginary term of complex number[s])
\item hermitian conjugate (and transpose)
\end{itemize}
\subsection{Scaling intepretation}
\label{sec-10_3}

$Av$ is simply scaled version of $v$ ($\lambda$ times); all components get magnified by the same amount
\subsection{Dynamic intepretation}
\label{sec-10_4}

For $Av=\lambda v$, if $\dot x= Ax,x(0)=v$ $\Rightarrow$ \fbox{$x(t) = e ^{\lambda t} v$} $= e ^{tA} v$.
\begin{itemize}
\item $A ^{2} v = \lambda ^{2} v$
\item So you just need a scalar in front of the $v$ to calculate $x(t)!$
\item \fbox{An eigenvector is an initial condition $x(0)$ for which the entire trajectory is really simple.}
\item solution $x(t) = e ^{\lambda t} v$ is a mode of $\dot x=Ax$ (associated with eigenvalue $\lambda$)
\end{itemize}
\subsection{Invariant set}
\label{sec-10_5}

a set $S \subseteq \mathbb{R}^{n}$ is \emph{invariant} under $\dot x = Ax$ if whenever $x(t) \in S$, then $x(\tau) \in S$ for all $\tau \ge t$ (you stay stuck within the set)
\begin{itemize}
\item vector field intepretation: trajectories only cut \emph{into} $S$
\end{itemize}
If a single point is an invariant set, it must be in the nullspace; $S=\{x_0\} \Leftrightarrow x_0 \in \mathcal{N}(A)$, so $Ax_0=0=\dot x$.
\begin{itemize}
\item line $\{tv | t \in \mathbb{R}\}$ is invariant for eigenvector $v$
\end{itemize}
\subsection{Complex eigenvectors}
\label{sec-10_6}

\begin{itemize}
\item for $a \in \mathbb C$, complex trajectory $a e ^{\lambda t} v$ satisfies $\dot x = Ax$, as well as \emph{real} part
\end{itemize}
$$
x(t) = \text{Re}(ae ^{\lambda t} v)
$$
$$
= e ^{\sigma t}
\begin{bmatrix}
  v _{re} & v _{im} \\
\end{bmatrix}
\begin{bmatrix}
  \cos \omega t  & \sin \omega t \\
  -\sin \omega t & \cos \omega t \\
\end{bmatrix}
\begin{bmatrix}
  \alpha \\
  -\beta \\
\end{bmatrix}
$$ 
where
$$
v= v _{re} + jv _{im} , \lambda = \sigma + j \omega, a = \alpha + j \beta
$$ 
\begin{itemize}
\item $\sigma$ gives logarithmic growth/decay factor
\item $\omega$ gives angular velocity of rotation in plane
\item trajectory stays in \emph{invariant plane} span $\{v _{re} ,v _{im}\}$
\end{itemize}
\subsection{Dynamic interpretation: left eigenvectors}
\label{sec-10_7}
\subsection{Summary:}
\label{sec-10_8}

\begin{itemize}
\item \emph{right eigenvectors} are initial conditions from which resulting motion is simple (i.e., remains on line or in plane)
\item \emph{left eigenvectors} give linear functions of state that are simple, for any initial condition
\end{itemize}
