lin-dyn-sys-stanford.org
** Example- companion matrix
- Easy to get the characteristic polynomial
- General truth: with these matrices you can't generally tell the system behavior by just looking at it
- If you push a signal through an integrator, it gets less wiggly
- By multiplying by the left eigenvector, you've filtered out the sinusoid?

* Lecture 13
** Example: Markov chain
Probability vector $p \in \mathbb{R}^{n}$ that you're in each of $n$ states: $p(t+1)=Pp(t)$. This probability evolves in time by being multiplied by state transition matrix $P$.
- $p _{i} (t)= {\bf Prob} (z(t)=i) \Rightarrow \sum ^{n} _{i=1} p _{i} (t) =1$ 
- sum of each column is 1
  - called stochastic
- i.e., $[1\;1\; \cdots 1]$ is a left eigenvector of $P$ with $\lambda = 1$
- so det($I-P$)=0, so there's also a nonzero right eigenvector s.t. $Pv=v$
  - $v$ can always be chosen to have non-negative elements, and can be normalized
- *Interpretation*: $v$ is an equilibrium distribution; you don't change your /probability/ distribution in time; always in $v$ 
  - if $v$ unique, it's called the steady-state distribution of the Markov chain
** Diagonalization
- $v_1,...,v_n$ is LI set of eigenvectors of $A \in \mathbb{R}^{n\times n}$: $Av_i=\lambda_i v_i$
- Concatenate in matrix language:
$$
A
\begin{bmatrix}
  v_1 & \cdots & v_n \\
\end{bmatrix}
=
\begin{bmatrix}
  v_1 & \cdots & v_n \\
\end{bmatrix}
\begin{bmatrix}
  \lambda_1 &           &        &           \\
            & \lambda_2 &        &           \\
            &           & \ddots &           \\
            &           &        & \lambda_n \\
\end{bmatrix}
$$
or, $AT=T\Lambda$, or $T ^{-1} AT=\Lambda$
- note, $T$ is invertible, since its columns are linearly independent
- This is why, while $Av=\lambda v$ is more commonly used for a scalar eigenvalue, \fbox{$Av=v\lambda$} is more general, as it can represent a vector of eigenvalues \lambda.
- so, $A$ is diagonalizable if
  - \exists $T$ s.t. $T ^{-1} AT=\Lambda$ is diagonal
  - $A$ has a set of linearly independent eigenvectors
    - if $A$ not diagonalizable, it is called defective
** Not all matrices diagonalizable
i.e.,
$$
A=
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
$$ 
** Distinct eigenvalues
*fact*: distinct eigenvalues in $A$ \Rightarrow $A$ diagonalizable
- converse not true, i.e., $I \in \mathbb{R}^{7\times 7}$
** Diagonalization and left eigenvectors
rewrite $T ^{-1} AT = \Lambda$ as $T ^{-1} A = \Lambda T ^{-1}$:
$$ 
\begin{bmatrix}
  w ^{T} _1 \\
  \vdots    \\
  w ^{T} _n \\
\end{bmatrix}
A=\Lambda
\begin{bmatrix}
  w ^{T} _1 \\
  \vdots    \\
  w ^{T} _n \\
\end{bmatrix}
$$
- remember that \Lambda is diagonal matrix, and multiplying by a diagonal matrix on the left is equivalent to scaling rows of the matrix
  - on the right scales the columns
Remeber left/right multiplication results (whether it scales columns or rows) with $2 \times 2$ matrix multiplication:
$$
\begin{bmatrix}
    2 &   0 \\
    0 &   3 \\
\end{bmatrix}
\begin{bmatrix}
  x_1 & x_2 \\
  y_1 & y_2 \\
\end{bmatrix}
=
\begin{bmatrix}
  2x_1 & 2x_2 \\
  3y_1 & 3y_2 \\
\end{bmatrix}
$$
I.e., right multiplication of diagonal matrix scales the rows.
- Take LI set of eigenvectors as columns, invert that matrix, then the rows are *left* eigenvectors
- An eigenvector is still an eigenvector after being scaled; so any can be normalized
** Modal form
Take a LI set of eigenvectors from $A$, shove them together as columns of new matrix $T$ = ``$A$ is diagonalizable by $T$''
- can define new coordinates by $x=T \tilde x$:
- $\tilde x$ is coordinates of $x$ in the $T$ expansion; modal (or eigenvector) expansion
  - $\tilde x$ is $x$ in terms of the eigenvectors
$$
T \dot{\tilde x}=AT \tilde x \Leftrightarrow \dot{ \tilde x}= T ^{-1} AT \tilde x \Leftrightarrow \dot{ \tilde x} = \Lambda \tilde x
$$
- in new coordinate system, system is diagonal (decoupled)
- normally, with $\dot x=Ax$, there's a ton of cross-gains from input $x_i$ to output $y_j$, where all the outputs depend on all the inputs (assuming $A$ has only non-zero entries)
  - \fbox{diagonalized system decouples it}; trajectory consists of $n$ independent modes:
$$
\tilde x_i (t) = e ^{\lambda_i t} \tilde x _{i} (0)
$$
** Real modal form
when eigenvalues (\Rightarrow $T$) are complex
- notes show block diagram of complex mode (note if real parts \sigma are removed, you get harmonic oscillator)
** Diagonalization simplification
Simplifies calculation of:
- resolvent
- powers ($A^k$)
- exponential ($e ^{A}=T {\bf diag} (e ^{\lambda_1},\dots, e ^{\lambda_n}) T ^{-1}$)
- So, diagonalization is largely a conceptual tool, and sometimes gives great computational advantage
** Simplify for analytical functions of a matrix
** Solution via diagonalization
$\dot x=Ax$ solution is $x(t)=e ^{tA} x(0)$
- with diagonalization, solution given as
$$
x(t) = \sum ^{n} _{i=1} e ^{\lambda_i t} (w_i ^{T} x(0))v_i
$$ 
** Interpretation
- (left eigenvectors) decompose initial state $x(0)$ into modal components $w ^{T} _{i} x(0)$
- $e ^{\lambda_i t}$ term propagates $i$ th mode forward $t$ seconds
- reconstruct state as linear combination of (right eigenvectors)
** Application
Finding $x(0)$ that gives stable solution.
** Stability of discrete-time systems
- powers of complex numbers $s^k$ go to zero if $|s|<1$
  - imaginary part tells how much of a rotation at each step you get
- \fbox{$x(t+1) = Ax(t)$ is stable iff all eigenvalues of $A$ have magnitude less than one}
- spectral radius of $A:\rho (A)= {\bf max} |\lambda _i |$
  - so it is a stable system iff $\rho(A)<1$
  - \rho gives rough growth or decay

** Jordan Canonical form
- /Any/ matrix $A \in \mathbb{R}^{n\times n}$ can be expressed in Jordan-canonical form (via `similarity transformation,' for some invertible matrix $T ^{-1}$)
$$
T ^{-1} AT=J=
\begin{bmatrix}
  J_1 &        &     \\
      & \ddots &     \\
      &        & J_q \\
\end{bmatrix}
$$ 
where
$$
J_i =
\begin{bmatrix}
  \lambda_i &         1 &        &           \\
            & \lambda_i & \ddots &           \\
            &           & \ddots &         1 \\
            &           &        & \lambda_i \\
\end{bmatrix}
\in \mathbb C ^{n_i \times n_i}
$$ 
- $J$ is `upper bidiagonal'
- Jordan form is unique (up to permutations of blocks- blocks might be in different places in the diagonal)
- /Almost/ strictly a conceptual tool; almost never used for numerical computations
- Jordan forms are inutil if the matrix is already diagonalizable
- When you get into Jordan form, you can use a chain of integrators to represent it in block diagram form
- Jordan blocks refer to dynamics blocks that cannot be decoupled
- \fbox{Jordan blocks yield:}
  - repeated poles in resolvent
  - terms of form $t ^{p} e ^{t\lambda}$ in $e ^{tA}$: \fbox{solution to $\dot x=Ax$ is in form of polynomials, with $t^n e^{\lambda t}$ terms}
** Jordan block example
$$
\dot x=
\begin{bmatrix}
  0 & 1 &   &   &   \\
    & 0 & 1 &   &   \\
    &   & 0 & 1 &   \\
    &   &   & 0 & 1 \\
\end{bmatrix}
x
$$ 
- Eigenvalues are all zero
- in the solutions you should expect $t ^{p} e^0$ ('constant') terms: solution of form $t + t ^{2} + t ^{3}$
