lin-dyn-sys-stanford.tex
\subsection{Example- companion matrix}
\label{sec-10_9}

\begin{itemize}
\item Easy to get the characteristic polynomial
\item General truth: with these matrices you can't generally tell the system behavior by just looking at it
\item If you push a signal through an integrator, it gets less wiggly
\item By multiplying by the left eigenvector, you've filtered out the sinusoid?
\end{itemize}
\section{Lecture 13}
\label{sec-11}
\subsection{Example: Markov chain}
\label{sec-11_1}

Probability vector $p \in \mathbb{R}^{n}$ that you're in each of $n$ states: $p(t+1)=Pp(t)$. This probability evolves in time by being multiplied by state transition matrix $P$.
\begin{itemize}
\item $p _{i} (t)= {\bf Prob} (z(t)=i) \Rightarrow \sum ^{n} _{i=1} p _{i} (t) =1$
\item sum of each column is 1

\begin{itemize}
\item called stochastic
\end{itemize}

\item i.e., $[1\;1\; \cdots 1]$ is a left eigenvector of $P$ with $\lambda = 1$
\item so det($I-P$)=0, so there's also a nonzero right eigenvector s.t. $Pv=v$

\begin{itemize}
\item $v$ can always be chosen to have non-negative elements, and can be normalized
\end{itemize}

\item \textbf{Interpretation}: $v$ is an equilibrium distribution; you don't change your \emph{probability} distribution in time; always in $v$

\begin{itemize}
\item if $v$ unique, it's called the steady-state distribution of the Markov chain
\end{itemize}

\end{itemize}
\subsection{Diagonalization}
\label{sec-11_2}

\begin{itemize}
\item $v_1,...,v_n$ is LI set of eigenvectors of $A \in \mathbb{R}^{n\times n}$: $Av_i=\lambda_i v_i$
\item Concatenate in matrix language:
\end{itemize}
$$
A
\begin{bmatrix}
  v_1 & \cdots & v_n \\
\end{bmatrix}
=
\begin{bmatrix}
  v_1 & \cdots & v_n \\
\end{bmatrix}
\begin{bmatrix}
  \lambda_1 &           &        &           \\
            & \lambda_2 &        &           \\
            &           & \ddots &           \\
            &           &        & \lambda_n \\
\end{bmatrix}
$$
or, $AT=T\Lambda$, or $T ^{-1} AT=\Lambda$
\begin{itemize}
\item note, $T$ is invertible, since its columns are linearly independent
\item This is why, while $Av=\lambda v$ is more commonly used for a scalar eigenvalue, \fbox{$Av=v\lambda$} is more general, as it can represent a vector of eigenvalues $\lambda$.
\item so, $A$ is diagonalizable if

\begin{itemize}
\item $\exists$ $T$ s.t. $T ^{-1} AT=\Lambda$ is diagonal
\item $A$ has a set of linearly independent eigenvectors

\begin{itemize}
\item if $A$ not diagonalizable, it is called defective
\end{itemize}

\end{itemize}

\end{itemize}
\subsection{Not all matrices diagonalizable}
\label{sec-11_3}

i.e.,
$$
A=
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
$$ 
\subsection{Distinct eigenvalues}
\label{sec-11_4}

\textbf{fact}: distinct eigenvalues in $A$ $\Rightarrow$ $A$ diagonalizable
\begin{itemize}
\item converse not true, i.e., $I \in \mathbb{R}^{7\times 7}$
\end{itemize}
\subsection{Diagonalization and left eigenvectors}
\label{sec-11_5}

rewrite $T ^{-1} AT = \Lambda$ as $T ^{-1} A = \Lambda T ^{-1}$:
$$ 
\begin{bmatrix}
  w ^{T} _1 \\
  \vdots    \\
  w ^{T} _n \\
\end{bmatrix}
A=\Lambda
\begin{bmatrix}
  w ^{T} _1 \\
  \vdots    \\
  w ^{T} _n \\
\end{bmatrix}
$$
\begin{itemize}
\item remember that $\Lambda$ is diagonal matrix, and multiplying by a diagonal matrix on the left is equivalent to scaling rows of the matrix

\begin{itemize}
\item on the right scales the columns
\end{itemize}

\end{itemize}
Remeber left/right multiplication results (whether it scales columns or rows) with $2 \times 2$ matrix multiplication:
$$
\begin{bmatrix}
    2 &   0 \\
    0 &   3 \\
\end{bmatrix}
\begin{bmatrix}
  x_1 & x_2 \\
  y_1 & y_2 \\
\end{bmatrix}
=
\begin{bmatrix}
  2x_1 & 2x_2 \\
  3y_1 & 3y_2 \\
\end{bmatrix}
$$
I.e., right multiplication of diagonal matrix scales the rows.
\begin{itemize}
\item Take LI set of eigenvectors as columns, invert that matrix, then the rows are \textbf{left} eigenvectors
\item An eigenvector is still an eigenvector after being scaled; so any can be normalized
\end{itemize}
\subsection{Modal form}
\label{sec-11_6}

Take a LI set of eigenvectors from $A$, shove them together as columns of new matrix $T$ = ``$A$ is diagonalizable by $T$''
\begin{itemize}
\item can define new coordinates by $x=T \tilde x$:
\item $\tilde x$ is coordinates of $x$ in the $T$ expansion; modal (or eigenvector) expansion

\begin{itemize}
\item $\tilde x$ is $x$ in terms of the eigenvectors
\end{itemize}

\end{itemize}
$$
T \dot{\tilde x}=AT \tilde x \Leftrightarrow \dot{ \tilde x}= T ^{-1} AT \tilde x \Leftrightarrow \dot{ \tilde x} = \Lambda \tilde x
$$
\begin{itemize}
\item in new coordinate system, system is diagonal (decoupled)
\item normally, with $\dot x=Ax$, there's a ton of cross-gains from input $x_i$ to output $y_j$, where all the outputs depend on all the inputs (assuming $A$ has only non-zero entries)

\begin{itemize}
\item \fbox{diagonalized system decouples it}; trajectory consists of $n$ independent modes:
\end{itemize}

\end{itemize}
$$
\tilde x_i (t) = e ^{\lambda_i t} \tilde x _{i} (0)
$$
\subsection{Real modal form}
\label{sec-11_7}

when eigenvalues ($\Rightarrow$ $T$) are complex
\begin{itemize}
\item notes show block diagram of complex mode (note if real parts $\sigma$ are removed, you get harmonic oscillator)
\end{itemize}
\subsection{Diagonalization simplification}
\label{sec-11_8}

Simplifies calculation of:
\begin{itemize}
\item resolvent
\item powers ($A^k$)
\item exponential ($e ^{A}=T {\bf diag} (e ^{\lambda_1},\dots, e ^{\lambda_n}) T ^{-1}$)
\item So, diagonalization is largely a conceptual tool, and sometimes gives great computational advantage
\end{itemize}
\subsection{Simplify for analytical functions of a matrix}
\label{sec-11_9}
\subsection{Solution via diagonalization}
\label{sec-11_10}

$\dot x=Ax$ solution is $x(t)=e ^{tA} x(0)$
\begin{itemize}
\item with diagonalization, solution given as
\end{itemize}
$$
x(t) = \sum ^{n} _{i=1} e ^{\lambda_i t} (w_i ^{T} x(0))v_i
$$ 
\subsection{Interpretation}
\label{sec-11_11}

\begin{itemize}
\item (left eigenvectors) decompose initial state $x(0)$ into modal components $w ^{T} _{i} x(0)$
\item $e ^{\lambda_i t}$ term propagates $i$ th mode forward $t$ seconds
\item reconstruct state as linear combination of (right eigenvectors)
\end{itemize}
\subsection{Application}
\label{sec-11_12}

Finding $x(0)$ that gives stable solution.
\subsection{Stability of discrete-time systems}
\label{sec-11_13}

\begin{itemize}
\item powers of complex numbers $s^k$ go to zero if $|s|<1$

\begin{itemize}
\item imaginary part tells how much of a rotation at each step you get
\end{itemize}

\item \fbox{$x(t+1) = Ax(t)$ is stable iff all eigenvalues of $A$ have magnitude less than one}
\item spectral radius of $A:\rho (A)= {\bf max} |\lambda _i |$

\begin{itemize}
\item so it is a stable system iff $\rho(A)<1$
\item $\rho$ gives rough growth or decay
\end{itemize}

\end{itemize}
\subsection{Jordan Canonical form}
\label{sec-11_14}

\begin{itemize}
\item \emph{Any} matrix $A \in \mathbb{R}^{n\times n}$ can be expressed in Jordan-canonical form (via `similarity transformation,' for some invertible matrix $T ^{-1}$)
\end{itemize}
$$
T ^{-1} AT=J=
\begin{bmatrix}
  J_1 &        &     \\
      & \ddots &     \\
      &        & J_q \\
\end{bmatrix}
$$ 
where
$$
J_i =
\begin{bmatrix}
  \lambda_i &         1 &        &           \\
            & \lambda_i & \ddots &           \\
            &           & \ddots &         1 \\
            &           &        & \lambda_i \\
\end{bmatrix}
\in \mathbb C ^{n_i \times n_i}
$$ 
\begin{itemize}
\item $J$ is `upper bidiagonal'
\item Jordan form is unique (up to permutations of blocks- blocks might be in different places in the diagonal)
\item \emph{Almost} strictly a conceptual tool; almost never used for numerical computations
\item Jordan forms are inutil if the matrix is already diagonalizable
\item When you get into Jordan form, you can use a chain of integrators to represent it in block diagram form
\item Jordan blocks refer to dynamics blocks that cannot be decoupled
\item \fbox{Jordan blocks yield:}

\begin{itemize}
\item repeated poles in resolvent
\item terms of form $t ^{p} e ^{t\lambda}$ in $e ^{tA}$: \fbox{solution to $\dot x=Ax$ is in form of polynomials, with $t^n e^{\lambda t}$ terms}
\end{itemize}

\end{itemize}
\subsection{Jordan block example}
\label{sec-11_15}

$$
\dot x=
\begin{bmatrix}
  0 & 1 &   &   &   \\
    & 0 & 1 &   &   \\
    &   & 0 & 1 &   \\
    &   &   & 0 & 1 \\
\end{bmatrix}
x
$$ 
\begin{itemize}
\item Eigenvalues are all zero
\item in the solutions you should expect $t ^{p} e^0$ (`constant') terms: solution of form $t + t ^{2} + t ^{3}$
\end{itemize}
