lin-dyn-sys-stanford.org
* Lecture 14
- Jordan canonical form: `closest you can get to diagonalizable form, if matrix isn't diagonalizable'
- via inverse Laplace transform:
$$
e ^{tJ_\lambda} = e ^{t \lambda} (I+t F_1 + \cdots + (t ^{k-1} /(k-1)!) F _{k-1})
$$

$$
= e ^{t \lambda}
\begin{bmatrix}
  1 & t & \cdots & t ^{k-1}/(k-1)! \\
    & 1 & \cdots & t ^{k-2}/(k-2)! \\
    &   & \ddots & \vdots          \\
    &   &        & 1               \\
\end{bmatrix}
$$

Jordan-blocks should be associated in your mind with polynomials times $e ^{\lambda t}$ 
- All FIR filters have Jordan blocks
** J-C application: Caley-Hamilton theorem
- if proving things about matrices, first show it for diagonalizable matrices, then with Jordan-Canonical form
- for any $n\times n$ matrix $A$, the powers of $A: I,A ^{2}, A ^{3},...,A ^{n}$ span $\mathbb{R}^{n\times n}$
  - $\mathcal X (A)=0$ (characteristic polynomial; by the time you get to $n$, you're getting dependent matrices)
- wrong proof for evaluating characteristic polynomial $\mathcal X(s)= {\bf det} (sI-A)$ at $A$:
  - $\mathcal X(A)= {\bf det} (AI-A)= {\bf det} (0)=0$ 
  - wrong, since definition of $\mathcal X$ involves $sI$ term, which is diagonal matrix (so $A$ can't be plugged into it)
- correct example for
$$
A= \begin{bmatrix}
  1 & 2 \\
  3 & 4 \\
\end{bmatrix}
$$ 
\begin{eqnarray}
  \mathcal X &=& A ^{2} -5A-2I \\
&=&
\begin{bmatrix}
   7 & 10 \\
  15 & 22 \\
\end{bmatrix}
-5
\begin{bmatrix}
  1 & 2 \\
  3 & 4 \\
\end{bmatrix}
-2I \\
&=& 0
\end{eqnarray}
- \fbox{Caley-Hamilton theorem: the square of a (square) matrix is a linear combination of the Identity matrix and itself}
  - the inverse is also a linear combination of $I$ and powers of $A$:
  - rewrite C-H theorem: $\mathcal X(A)= A ^{n} + a _{n-1} A ^{n-1} + \cdots + a _{0} I=0$ as
    - $I=A\left( -(a_1 /a_0)I-(a_2 /a_0)A - \cdots -(1 /a_0) A ^{n-1} \right)$
$$
A ^{-1} =  -(a_1 /a_0)I-(a_2 /a_0)A - \cdots -(1 /a_0) A ^{n-1} 
$$ 
- Corollary: for every $p \in \mathbb Z_+$,
$$A ^{p} \in {\bf span} \{I,A,A ^{2} ...,A ^{n-1} \}$$
** Solving huge matrix equations
- usually have a method for fast matrix vector multiplication: $Az$
- if you can do a quick $Az$ calculation, you can also do a quick $A ^{2} z,...A ^{n-1} z$ calculation
  - using C-H thm, you can put scalars in front of them to get $A^{-1}$ 
** LTI system inputs & outputs
LTI systems with input and outputs have the form $\dot x=Ax+Bu, y=Cx+Du$; $Ax$ is the /drift/ term, $Bu$ is the /input/ term. For 
** Interpretations
- state derivative $\dot x$ is the sum of the autonomous term $Ax$ and one term per input, $b_i u_i$
  - if columns of $B$ are independent, each input $u_i$ gives another degree of freedom for $\dot x$
  - column $i$ of $B$ represents how much input $i$ affects $\dot x$
  - row $i$ of $B$ represents how much input $i$ affects the $i$ th component of $\dot x$
- Good block diagram in notes, pg. 13-5
** Transfer matrix
- Solution to $\dot x=Ax+Bu$ via Laplace transform is \fbox{$\displaystyle x(t)= e ^{tA} x(0) + \int ^{t} _{0} e ^{(t-\tau) A} Bu (\tau) d\tau$ }
  - $e ^{tA} x(0)$ is the (unforced or) autonomous response
  - $e ^{tA} B$ is the `input-to-state impulse matrix'
    - integral term is convolution
  - $(sI-A) ^{-1} B$ is input-to-state /transfer matrix/; the resolvent \times $B$
- Readout equation, $y=Cx+Du$ solution (via Laplacian)
  - \fbox{$y(t) = C e ^{tA} x(0) + \int ^{t} _{0} C e ^{(t-\tau)A} B u(\tau) d\tau + Du(t)$}
  - transfer function: $H(s)= C(sI-A) ^{-1} B+D$
  - impulse matrix/impulse response: $h(t)= C e ^{tA} B + D \delta(t)$
  - zero initial condition gives $Y(s)= H(s)U(s), y=h*u$
    - $H _{ij}$ is transfer function from input $u _{j}$ to output $y _{i}$
- Mnemonic for convolution intuition $\displaystyle y(t) = \int^{t}_{0} h(t-\tau) u(\tau) d\tau$:
  - output is `linear combination' or `mixture' of input in the past $u(\tau)$, weighted by how many seconds ago something happened
  - \tau is `seconds ago'
  - example: if $h(7)$ is really big \rightarrow output depends a /lot/ on the input 7 seconds ago
    - remember, the $h$ term has been delayed and flipped: $h(-(\tau-t))$ 
  - if $h(t)$ decays, the system has /fading memory/ 
** Impulse matrix
- $h(t) = C e ^{tA} B+D \delta(t), x(0)=0,y=h*u$
$$
y_i(t) = \sum ^{m} _{j=1} \int ^{t} _{0} h _{ij} (t-\tau) u _{j} (\tau) d\tau
$$ 
- for rain/river metaphor, where rain is input and river level is output, this matrix is summed over the input, with different regions of rainfall $u_j$ and different locations of the river where rainfall is measured, $y_i(t)$ 
** Step response
$$
s(t) = \int ^{t} _{0} h(\tau) d\tau
$$ 
** Spring dashpot example
** RC circuit example
* Lecture 15
** DC or static gain matrix
- transfer matrix at $s=0$ is $H(0)= -CA ^{-1} B + D \in \mathbb{R}^{m \times p}$
- DC transfer matrix describes system under static conditions: $x,u,y$ constant
  - $\Rightarrow y=H(0)u$
  - if system is stable, $\displaystyle H(0)= \int ^{\infty} _{0} h(t) dt= \lim_{t\rightarrow \infty} s(t)$
** Discretization with piecewise constant inputs
** Causality
** Idea of state
- $x(t)$ is state of system at time $t$:
  - future output depends only on /current state/ and /future output/
    - sufficient statistic of what happened in the past to be able to predict the future
  - bridge between past inputs and future outputs
    - `past and future are conditionally independent, given the state' (-machine learning )
** Change of coordinates
- start with LDS $\dot x=Ax+Bu,y=Cx+Du$
- change coordinates in $\mathbb{R}^{n}$ to $\tilde x$ with $x=T \tilde x$
$$ 
\dot{\tilde x} = T ^{-1} \dot x = T ^{-1} (Ax+Bu) = T ^{-1} AT \tilde x + T ^{-1} Bu
$$
- LDS can be expressed as
$$
\dot{\tilde x} = \tilde A \tilde x+\tilde B u, y= \tilde C \tilde x + \tilde D u
$$
where
$$ 
\tilde A = T ^{-1} A T, \tilde B= T ^{-1} B, \tilde C = CT, \tilde D=D
$$ 
- You might want to do this to, i.e., get an $A$ with a bunch of zeros, since the system might be much easier to implement
** Standard forms for LDS
Can change coordinates to put $A$ in various forms (diagonal, real modal, Jordan ...)
** Discrete-time systems
(Another block diagram in notes)
** Z-transform
** Discrete-time transfer function
- re-derivation of stuff we know, using the frequency domain
* Last Section, Singular Value Decomposition
** Eigenvalues of symmetric matrices
Given $A \in \mathbb{R}^{n\times n}:A=A ^{T}$ 
- eigenvalues always real
- $Av=\lambda v, v\ne 0,v\in \mathbb C^n$; remember conjugate transpose, $\bar v ^{T}=v ^{H} = v ^{*T}$, or, in MATLAB,
: v'
and remember, $\bar a a= |a| ^{2}$ 
$$
\Rightarrow v ^{H} Av= v ^{H} (Av) = \lambda v ^{H} v = \lambda \sum ^{n} _{i=1} |v_1| ^{2} 
$$ 
$$ 
...= \bar \lambda \sum ^{n} _{i=1} |v_1| ^{2} 
$$ 
so $\lambda = \bar \lambda \Rightarrow \lambda \in \mathbb{R}^{n}$
