lin-dyn-sys-stanford.tex
\section{Lecture 14}
\label{sec-12}

\begin{itemize}
\item Jordan canonical form: `closest you can get to diagonalizable form, if matrix isn't diagonalizable'
\item via inverse Laplace transform:
\end{itemize}
$$
e ^{tJ_\lambda} = e ^{t \lambda} (I+t F_1 + \cdots + (t ^{k-1} /(k-1)!) F _{k-1})
$$

$$
= e ^{t \lambda}
\begin{bmatrix}
  1 & t & \cdots & t ^{k-1}/(k-1)! \\
    & 1 & \cdots & t ^{k-2}/(k-2)! \\
    &   & \ddots & \vdots          \\
    &   &        & 1               \\
\end{bmatrix}
$$

Jordan-blocks should be associated in your mind with polynomials times $e ^{\lambda t}$ 
\begin{itemize}
\item All FIR filters have Jordan blocks
\end{itemize}
\subsection{J-C application: Caley-Hamilton theorem}
\label{sec-12_1}

\begin{itemize}
\item if proving things about matrices, first show it for diagonalizable matrices, then with Jordan-Canonical form
\item for any $n\times n$ matrix $A$, the powers of $A: I,A ^{2}, A ^{3},...,A ^{n}$ span $\mathbb{R}^{n\times n}$

\begin{itemize}
\item $\mathcal X (A)=0$ (characteristic polynomial; by the time you get to $n$, you're getting dependent matrices)
\end{itemize}

\item wrong proof for evaluating characteristic polynomial $\mathcal X(s)= {\bf det} (sI-A)$ at $A$:

\begin{itemize}
\item $\mathcal X(A)= {\bf det} (AI-A)= {\bf det} (0)=0$
\item wrong, since definition of $\mathcal X$ involves $sI$ term, which is diagonal matrix (so $A$ can't be plugged into it)
\end{itemize}

\item correct example for
\end{itemize}
$$
A= \begin{bmatrix}
  1 & 2 \\
  3 & 4 \\
\end{bmatrix}
$$ 
\begin{eqnarray}
  \mathcal X &=& A ^{2} -5A-2I \\
&=&
\begin{bmatrix}
   7 & 10 \\
  15 & 22 \\
\end{bmatrix}
-5
\begin{bmatrix}
  1 & 2 \\
  3 & 4 \\
\end{bmatrix}
-2I \\
&=& 0
\end{eqnarray}
\begin{itemize}
\item \fbox{Caley-Hamilton theorem: the square of a (square) matrix is a linear combination of the Identity matrix and itself}

\begin{itemize}
\item the inverse is also a linear combination of $I$ and powers of $A$:
\item rewrite C-H theorem: $\mathcal X(A)= A ^{n} + a _{n-1} A ^{n-1} + \cdots + a _{0} I=0$ as

\begin{itemize}
\item $I=A\left( -(a_1 /a_0)I-(a_2 /a_0)A - \cdots -(1 /a_0) A ^{n-1} \right)$
\end{itemize}

\end{itemize}

\end{itemize}
$$
A ^{-1} =  -(a_1 /a_0)I-(a_2 /a_0)A - \cdots -(1 /a_0) A ^{n-1} 
$$ 
\begin{itemize}
\item Corollary: for every $p \in \mathbb Z_+$,
\end{itemize}
$$A ^{p} \in {\bf span} \{I,A,A ^{2} ...,A ^{n-1} \}$$
\subsection{Solving huge matrix equations}
\label{sec-12_2}

\begin{itemize}
\item usually have a method for fast matrix vector multiplication: $Az$
\item if you can do a quick $Az$ calculation, you can also do a quick $A ^{2} z,...A ^{n-1} z$ calculation

\begin{itemize}
\item using C-H thm, you can put scalars in front of them to get $A^{-1}$
\end{itemize}

\end{itemize}
\subsection{LTI system inputs \& outputs}
\label{sec-12_3}

LTI systems with input and outputs have the form $\dot x=Ax+Bu, y=Cx+Du$; $Ax$ is the \emph{drift} term, $Bu$ is the \emph{input} term. For 
\subsection{Interpretations}
\label{sec-12_4}

\begin{itemize}
\item state derivative $\dot x$ is the sum of the autonomous term $Ax$ and one term per input, $b_i u_i$

\begin{itemize}
\item if columns of $B$ are independent, each input $u_i$ gives another degree of freedom for $\dot x$
\item column $i$ of $B$ represents how much input $i$ affects $\dot x$
\item row $i$ of $B$ represents how much input $i$ affects the $i$ th component of $\dot x$
\end{itemize}

\item Good block diagram in notes, pg. 13-5
\end{itemize}
\subsection{Transfer matrix}
\label{sec-12_5}

\begin{itemize}
\item Solution to $\dot x=Ax+Bu$ via Laplace transform is \fbox{$\displaystyle x(t)= e ^{tA} x(0) + \int ^{t} _{0} e ^{(t-\tau) A} Bu (\tau) d\tau$ }

\begin{itemize}
\item $e ^{tA} x(0)$ is the (unforced or) autonomous response
\item $e ^{tA} B$ is the `input-to-state impulse matrix'

\begin{itemize}
\item integral term is convolution
\end{itemize}

\item $(sI-A) ^{-1} B$ is input-to-state \emph{transfer matrix}; the resolvent \texttimes{} $B$
\end{itemize}

\item Readout equation, $y=Cx+Du$ solution (via Laplacian)

\begin{itemize}
\item \fbox{$y(t) = C e ^{tA} x(0) + \int ^{t} _{0} C e ^{(t-\tau)A} B u(\tau) d\tau + Du(t)$}
\item transfer function: $H(s)= C(sI-A) ^{-1} B+D$
\item impulse matrix/impulse response: $h(t)= C e ^{tA} B + D \delta(t)$
\item zero initial condition gives $Y(s)= H(s)U(s), y=h*u$

\begin{itemize}
\item $H _{ij}$ is transfer function from input $u _{j}$ to output $y _{i}$
\end{itemize}

\end{itemize}

\item Mnemonic for convolution intuition $\displaystyle y(t) = \int^{t}_{0} h(t-\tau) u(\tau) d\tau$:

\begin{itemize}
\item output is `linear combination' or `mixture' of input in the past $u(\tau)$, weighted by how many seconds ago something happened
\item $\tau$ is `seconds ago'
\item example: if $h(7)$ is really big $\rightarrow$ output depends a \emph{lot} on the input 7 seconds ago

\begin{itemize}
\item remember, the $h$ term has been delayed and flipped: $h(-(\tau-t))$
\end{itemize}

\item if $h(t)$ decays, the system has \emph{fading memory}
\end{itemize}

\end{itemize}
\subsection{Impulse matrix}
\label{sec-12_6}

\begin{itemize}
\item $h(t) = C e ^{tA} B+D \delta(t), x(0)=0,y=h*u$
\end{itemize}
$$
y_i(t) = \sum ^{m} _{j=1} \int ^{t} _{0} h _{ij} (t-\tau) u _{j} (\tau) d\tau
$$ 
\begin{itemize}
\item for rain/river metaphor, where rain is input and river level is output, this matrix is summed over the input, with different regions of rainfall $u_j$ and different locations of the river where rainfall is measured, $y_i(t)$
\end{itemize}
\subsection{Step response}
\label{sec-12_7}

$$
s(t) = \int ^{t} _{0} h(\tau) d\tau
$$ 
\subsection{Spring dashpot example}
\label{sec-12_8}
\subsection{RC circuit example}
\label{sec-12_9}
\section{Lecture 15}
\label{sec-13}
\subsection{DC or static gain matrix}
\label{sec-13_1}

\begin{itemize}
\item transfer matrix at $s=0$ is $H(0)= -CA ^{-1} B + D \in \mathbb{R}^{m \times p}$
\item DC transfer matrix describes system under static conditions: $x,u,y$ constant

\begin{itemize}
\item $\Rightarrow y=H(0)u$
\item if system is stable, $\displaystyle H(0)= \int ^{\infty} _{0} h(t) dt= \lim_{t\rightarrow \infty} s(t)$
\end{itemize}

\end{itemize}
\subsection{Discretization with piecewise constant inputs}
\label{sec-13_2}
\subsection{Causality}
\label{sec-13_3}
\subsection{Idea of state}
\label{sec-13_4}

\begin{itemize}
\item $x(t)$ is state of system at time $t$:

\begin{itemize}
\item future output depends only on \emph{current state} and \emph{future output}

\begin{itemize}
\item sufficient statistic of what happened in the past to be able to predict the future
\end{itemize}

\item bridge between past inputs and future outputs

\begin{itemize}
\item `past and future are conditionally independent, given the state' (-machine learning )
\end{itemize}

\end{itemize}

\end{itemize}
\subsection{Change of coordinates}
\label{sec-13_5}

\begin{itemize}
\item start with LDS $\dot x=Ax+Bu,y=Cx+Du$
\item change coordinates in $\mathbb{R}^{n}$ to $\tilde x$ with $x=T \tilde x$
\end{itemize}
$$ 
\dot{\tilde x} = T ^{-1} \dot x = T ^{-1} (Ax+Bu) = T ^{-1} AT \tilde x + T ^{-1} Bu
$$
\begin{itemize}
\item LDS can be expressed as
\end{itemize}
$$
\dot{\tilde x} = \tilde A \tilde x+\tilde B u, y= \tilde C \tilde x + \tilde D u
$$
where
$$ 
\tilde A = T ^{-1} A T, \tilde B= T ^{-1} B, \tilde C = CT, \tilde D=D
$$ 
\begin{itemize}
\item You might want to do this to, i.e., get an $A$ with a bunch of zeros, since the system might be much easier to implement
\end{itemize}
\subsection{Standard forms for LDS}
\label{sec-13_6}

Can change coordinates to put $A$ in various forms (diagonal, real modal, Jordan \ldots{})
\subsection{Discrete-time systems}
\label{sec-13_7}

(Another block diagram in notes)
\subsection{Z-transform}
\label{sec-13_8}
\subsection{Discrete-time transfer function}
\label{sec-13_9}

\begin{itemize}
\item re-derivation of stuff we know, using the frequency domain
\end{itemize}
\section{Last Section, Singular Value Decomposition}
\label{sec-14}
\subsection{Eigenvalues of symmetric matrices}
\label{sec-14_1}

Given $A \in \mathbb{R}^{n\times n}:A=A ^{T}$ 
\begin{itemize}
\item eigenvalues always real
\item $Av=\lambda v, v\ne 0,v\in \mathbb C^n$; remember conjugate transpose, $\bar v ^{T}=v ^{H} = v ^{*T}$, or, in MATLAB,
\end{itemize}
\begin{verbatim}
 v'
\end{verbatim}

and remember, $\bar a a= |a| ^{2}$ 
$$
\Rightarrow v ^{H} Av= v ^{H} (Av) = \lambda v ^{H} v = \lambda \sum ^{n} _{i=1} |v_1| ^{2} 
$$ 
$$ 
...= \bar \lambda \sum ^{n} _{i=1} |v_1| ^{2} 
$$ 
so $\lambda = \bar \lambda \Rightarrow \lambda \in \mathbb{R}^{n}$
