lin-dyn-sys-stanford.org
** Eigenvectors of symmetric matrices
*fact:* There is a set of orthonormal eigenvectors of $A$, $q_1,...,q_n: Aq_i=\lambda_i q_i, q_i ^{T} q_j = \delta _{ij}$ 
- In matrix form, \exists orthogonal $Q: Q ^{-1} AQ = Q ^{T} AQ = \Lambda$
- or, rewrite /dyadic expansion of A/:
$$
A = Q \Lambda Q ^{T} = \sum ^{n} _{i=1} \lambda (q_i q_i ^{T})
$$
- /engineering etiquette aside/: ``The eigenvectors of a symmetric matrix are orthonormal" makes no sense; any matrix has zillions of eigenvectors
  - but rather, ``you can choose the eigenvectors of a symmetric matrix to be orthonormal"
** Interpretations
Given $A=Q \Lambda Q ^{T}$. Remember, $Q ^{-1} =Q ^{T}$. (Notes have block diagram.)
This means, to multiply a vector $x$ by $A$, first multiply it by $Q^T$, then \Lambda, then $Q$
- first operation result $Q ^{T} x=Q ^{-1} x$ `resolves $x$ in the $q_i$ coordinates'
- next: simple to multiply by diagonal matrix \Lambda (simply scaling the matrix)
- last: multiplying by $Q$ `reconstitutes the output'
- \fbox{multiplying by $Q ^{T}, \Lambda, Q$ represents a `coding,' scaling, reconstruction operation }
- Application: in JPEG, do DCT transformation, quantize in middle, then decode the image in last step
- Geometrically:
  - rotate by $Q^T$
  - dilation by $A$
  - rotate back by $Q$
Decomposition (review)
$$ 
A = \sum ^{n} _{i=1} \lambda _{i} q _{i} q _{i} ^{T} 
$$
expresses $A$ as linear combination of 1-dimensional projections.

If a matrix is real and symmetric, (and the eigenvalues of a matrix are distinct,) then any set of associated eigenvectors is orthogonal (and can be normalized).
$$ 
A v _{i} =\lambda _{i} v _{i}, \|v_i\| = 1
$$
Then,
$$ 
v _{i} ^{T} (A v _{j} ) = \lambda _{j} v _{i} ^{T} v _{j} = (A v _{i} ) ^{T} v _{j} = \lambda _{i} v _{i} ^{T} v _{j} 
$$
so $(\lambda_i - \lambda_j) v _{i} ^{T} v _{j} =0$ for $i\ne j, \lambda _{i} \ne \lambda _{j}$ \fbox{$\Rightarrow v _{i} ^{T} v _{j} =0$ }
So distinct eigenvectors of a symmetric real matrix are `orthogonal'
** Example: RC circuit
* Lecture 16
** Quadratic forms
Previously, we did mappings of form $y=Ax$, or $\dot x=Ax$. We're no longer doing problems with a linear structure.
- New form is /quadratic form/
$$
f(x) = x ^{T} Ax= \sum ^{n} _{i,j=1} A _{ij} x _{i} x _{j} 
$$
- $(x ^{T} A x) ^{T} = x ^{T} A ^{T} x$
- $x ^{T} Ax= x ^{T} ((A +A ^{T} )/2)x$ is another form of quadratic form; the middle part is the average of itself (member of $A$) and its associated trasposed self
- weird etiquette: $A$ should be symmetric if you're dealing with quadratic forms
  - often may want to symmetrize it to make it safe
  - i.e., this quadratic form
$$
x ^{T}
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
x= x_1 x_2
$$

$$
x ^{T}
\begin{bmatrix}
     0 & 3/2 \\
  -1/2 & 0   \\
\end{bmatrix}
x= x_1 x_2
$$
But the canonical form would have 1/2 in the 2nd and 3rd entry (row-wise).
- If $A$ is diagonal in LDS, $y=Ax$, it means there is no cross-coupling. If $A$ is diagonal in a quadratic form, it gives you a weighted sum of squares.
- *uniqueness:* if $x ^{T} Ax=x ^{T} Bx$ for all $x \in \mathbb{R}^{n}$ and $A=A^T, B = B ^{T}$, then $A=B$
** Examples of quadratic forms
- $\| B x \| ^{2} = x ^{T} (B ^{T} B)x; B ^{T} B is already symmetric$
- $\sum ^{n-1} _{i=1} (x _{i+1} - x _{i} ) ^{2}$. This measures `wiggliness' of signal; sum of squares of difference from one to the next signal
  - to get in quadratic form, multiply out: $x ^{2} _{i+1} + x ^{2} _{i} - 2 x _{i} x _{i+1}$:
$$
\begin{bmatrix}
  x_1 & x_2 & x_3 \\
\end{bmatrix}
\begin{bmatrix}
   1 & -1 &  0 \\
  -1 &  2 & -1 \\
   0 & -1 &  1 \\
\end{bmatrix}
\begin{bmatrix}
  x_1 \\
  x_2 \\
  x_3 \\
\end{bmatrix}
$$ 
- Zeros in corners of matrix, since there is no product between $x_1,x_3$
- $\| Fx \| ^{2} - \| Gx \| ^{2}$
  - $x ^{T} (F ^{T} F-G ^{T} G) x$ 
- quadratic surface: level set: $\{ x| f(x) = a\}$
- quadratic region: $\{ x|f(x) \le a \}$
  - unit ball: $\{x | x ^{T} x \le 1\}$ 
  - unit sphere: $\{x | x ^{T} x = 1\}$ 
** Inequalities for quadratic forms
If $A = A ^{T}$, it is diagonalizable: $A = Q \Lambda Q ^{T}$ with sorted eigenvalues in \Lambda
\begin{eqnarray}
  x ^{T} Ax &=& x ^{T} Q \Lambda Q ^{T} x \\
   &=& (Q^Tx) ^{T} \Lambda(Q ^{T}x) \\
   &=& \sum ^{n} _{i=1} \lambda _{i} (q ^{T} _{i} x ) ^{2}  \\
   &\le& \lambda _{1} \sum ^{n} _{i=1} (q _{i} ^{T} x) ^{2}  \\
   &=& \lambda_1 \| x \| ^{2}\\
\end{eqnarray}
- So, how big can the quadratic form be?
  - $x ^{T} Ax \le \lambda_1 x ^{T} x$
- Another important inequality
$$
\lambda_n x ^{T} x \le x ^{T} Ax \le \lambda_1 x ^{T} x
$$
- \lambda_1 sometimes called \lambda _{max}, \lambda _{n} called \lambda _{min}
- for \fbox{$A = A ^{T}$} $\in \mathbb{R}^{n\times n}$, $A$ is /positive semidefinite/ if $x ^{T} Ax \ge 0$ for all $x$
  - notation: $A\ge0$
  - iff $\lambda _{min} (A) \ge 0$: all eigenvalues nonnegative
  - $A$ is /positive definite/ if $x ^{T} Ax >0$ for all $x\ne 0$
- $A\ge 0 \Rightarrow A _{ij} \ge 0$
- if $A$ not positive or negative [semi]definite, it is /indefinite/
- matrices *can be* /incomparable/:
  - $A \ngeq B$ *and* $B \ngeq A$, where it will depend on the $x$ (depend on the direction you're looking at it from)
- $A \le B$ statement requires that both be square matrices, and probably symmetric (depending on social norms)
  - if not symmetric, it means $\frac{A+A^T}{2} \le \frac{B+B^T}{2}$ 
** Ellipsoids
- if $A ^{T} > 0$, the set $\mathcal E = \{x | x ^{T} Ax \le 1 \}$ is an /ellipsoid/ in $\mathbb{R}^{n}$, centered at 0
- semi-axes given by $s _{i} = \lambda _{i} ^{-1/2} q _{i}$
  - eigenvectors determine directions of semiaxes
  - eigenvalues determine lengths of semiaxes
  - $\sqrt{\lambda_{max} / \lambda_{min}}$ gives maximum eccentricity
- eigenvalue intuition in $\mathbb{R}^{3}$ 
  - large pancake shape \Rightarrow one large eigenvalue, two slightly smaller eigenvalues
  - long cigar shape \Rightarrow two large eigenvalues, one small eigenvalue
** Gain of matrix in a direction
For $A \in \mathbb{R}^{m\times n}$ (not necessarily symmetric anymore), for $x \in \mathbb{R}^{n}, \|Ax\| / \|x \|$ gives /amplification factor/ or /gain/ of $A$ in direction $x$, and will vary with different $x$ directions
- Questions we will ask
  - maximum gain of $A$
    - \fbox{$\displaystyle \max _{x\ne 0} \frac{\|Ax\|}{\|x\|}$}
    - /matrix norm/ or /spectral norm/, and denoted $\|A\|$ (overloading)
    - $\displaystyle \max _{x\ne 0} \frac{\|Ax\|}{\|x\|} = \max _{x \ne 0} \frac{x^TA^TAx}{\|x\|^2} = \lambda _{\max} (A ^{T} A)$
    - so, $\|A \|= \sqrt{\lambda _{\max} (A ^{T} A)}$ 
  - minimum gain of $A$
    - $\displaystyle \min _{x\ne 0} \|Ax\| / \|x\| = \sqrt{\lambda _{\min} (A ^{T} A)}$ 
  - how does gain of $A$ vary with direction
- Will give us a /quantitative way/ to talk about nullspace
** Example
** Properties of matrix norm
- triangle inequality
- scaling
- definiteness: $\|A\|= 0 \Leftrightarrow A = 0$
- norm of a product inequality
* Lecture 17
