lin-dyn-sys-stanford.tex
\subsection{Eigenvectors of symmetric matrices}
\label{sec-14_2}

\textbf{fact:} There is a set of orthonormal eigenvectors of $A$, $q_1,...,q_n: Aq_i=\lambda_i q_i, q_i ^{T} q_j = \delta _{ij}$ 
\begin{itemize}
\item In matrix form, $\exists$ orthogonal $Q: Q ^{-1} AQ = Q ^{T} AQ = \Lambda$
\item or, rewrite \emph{dyadic expansion of A}:
\end{itemize}
$$
A = Q \Lambda Q ^{T} = \sum ^{n} _{i=1} \lambda (q_i q_i ^{T})
$$
\begin{itemize}
\item \emph{engineering etiquette aside}: ``The eigenvectors of a symmetric matrix are orthonormal'' makes no sense; any matrix has zillions of eigenvectors

\begin{itemize}
\item but rather, ``you can choose the eigenvectors of a symmetric matrix to be orthonormal''
\end{itemize}

\end{itemize}
\subsection{Interpretations}
\label{sec-14_3}

Given $A=Q \Lambda Q ^{T}$. Remember, $Q ^{-1} =Q ^{T}$. (Notes have block diagram.)
This means, to multiply a vector $x$ by $A$, first multiply it by $Q^T$, then $\Lambda$, then $Q$
\begin{itemize}
\item first operation result $Q ^{T} x=Q ^{-1} x$ `resolves $x$ in the $q_i$ coordinates'
\item next: simple to multiply by diagonal matrix $\Lambda$ (simply scaling the matrix)
\item last: multiplying by $Q$ `reconstitutes the output'
\item \fbox{multiplying by $Q ^{T}, \Lambda, Q$ represents a `coding,' scaling, reconstruction operation }
\item Application: in JPEG, do DCT transformation, quantize in middle, then decode the image in last step
\item Geometrically:

\begin{itemize}
\item rotate by $Q^T$
\item dilation by $A$
\item rotate back by $Q$
\end{itemize}

\end{itemize}
Decomposition (review)
$$ 
A = \sum ^{n} _{i=1} \lambda _{i} q _{i} q _{i} ^{T} 
$$
expresses $A$ as linear combination of 1-dimensional projections.

If a matrix is real and symmetric, (and the eigenvalues of a matrix are distinct,) then any set of associated eigenvectors is orthogonal (and can be normalized).
$$ 
A v _{i} =\lambda _{i} v _{i}, \|v_i\| = 1
$$
Then,
$$ 
v _{i} ^{T} (A v _{j} ) = \lambda _{j} v _{i} ^{T} v _{j} = (A v _{i} ) ^{T} v _{j} = \lambda _{i} v _{i} ^{T} v _{j} 
$$
so $(\lambda_i - \lambda_j) v _{i} ^{T} v _{j} =0$ for $i\ne j, \lambda _{i} \ne \lambda _{j}$ \fbox{$\Rightarrow v _{i} ^{T} v _{j} =0$ }
So distinct eigenvectors of a symmetric real matrix are `orthogonal'
\subsection{Example: RC circuit}
\label{sec-14_4}
\section{Lecture 16}
\label{sec-15}
\subsection{Quadratic forms}
\label{sec-15_1}

Previously, we did mappings of form $y=Ax$, or $\dot x=Ax$. We're no longer doing problems with a linear structure.
\begin{itemize}
\item New form is \emph{quadratic form}
\end{itemize}
$$
f(x) = x ^{T} Ax= \sum ^{n} _{i,j=1} A _{ij} x _{i} x _{j} 
$$
\begin{itemize}
\item $(x ^{T} A x) ^{T} = x ^{T} A ^{T} x$
\item $x ^{T} Ax= x ^{T} ((A +A ^{T} )/2)x$ is another form of quadratic form; the middle part is the average of itself (member of $A$) and its associated trasposed self
\item weird etiquette: $A$ should be symmetric if you're dealing with quadratic forms

\begin{itemize}
\item often may want to symmetrize it to make it safe
\item i.e., this quadratic form
\end{itemize}

\end{itemize}
$$
x ^{T}
\begin{bmatrix}
  0 & 1 \\
  0 & 0 \\
\end{bmatrix}
x= x_1 x_2
$$

$$
x ^{T}
\begin{bmatrix}
     0 & 3/2 \\
  -1/2 & 0   \\
\end{bmatrix}
x= x_1 x_2
$$
But the canonical form would have 1/2 in the 2nd and 3rd entry (row-wise).
\begin{itemize}
\item If $A$ is diagonal in LDS, $y=Ax$, it means there is no cross-coupling. If $A$ is diagonal in a quadratic form, it gives you a weighted sum of squares.
\item \textbf{uniqueness:} if $x ^{T} Ax=x ^{T} Bx$ for all $x \in \mathbb{R}^{n}$ and $A=A^T, B = B ^{T}$, then $A=B$
\end{itemize}
\subsection{Examples of quadratic forms}
\label{sec-15_2}

\begin{itemize}
\item $\| B x \| ^{2} = x ^{T} (B ^{T} B)x; B ^{T} B is already symmetric$
\item $\sum ^{n-1} _{i=1} (x _{i+1} - x _{i} ) ^{2}$. This measures `wiggliness' of signal; sum of squares of difference from one to the next signal

\begin{itemize}
\item to get in quadratic form, multiply out: $x ^{2} _{i+1} + x ^{2} _{i} - 2 x _{i} x _{i+1}$:
\end{itemize}

\end{itemize}
$$
\begin{bmatrix}
  x_1 & x_2 & x_3 \\
\end{bmatrix}
\begin{bmatrix}
   1 & -1 &  0 \\
  -1 &  2 & -1 \\
   0 & -1 &  1 \\
\end{bmatrix}
\begin{bmatrix}
  x_1 \\
  x_2 \\
  x_3 \\
\end{bmatrix}
$$ 
\begin{itemize}
\item Zeros in corners of matrix, since there is no product between $x_1,x_3$
\item $\| Fx \| ^{2} - \| Gx \| ^{2}$

\begin{itemize}
\item $x ^{T} (F ^{T} F-G ^{T} G) x$
\end{itemize}

\item quadratic surface: level set: $\{ x| f(x) = a\}$
\item quadratic region: $\{ x|f(x) \le a \}$

\begin{itemize}
\item unit ball: $\{x | x ^{T} x \le 1\}$
\item unit sphere: $\{x | x ^{T} x = 1\}$
\end{itemize}

\end{itemize}
\subsection{Inequalities for quadratic forms}
\label{sec-15_3}

If $A = A ^{T}$, it is diagonalizable: $A = Q \Lambda Q ^{T}$ with sorted eigenvalues in $\Lambda$
\begin{eqnarray}
  x ^{T} Ax &=& x ^{T} Q \Lambda Q ^{T} x \\
   &=& (Q^Tx) ^{T} \Lambda(Q ^{T}x) \\
   &=& \sum ^{n} _{i=1} \lambda _{i} (q ^{T} _{i} x ) ^{2}  \\
   &\le& \lambda _{1} \sum ^{n} _{i=1} (q _{i} ^{T} x) ^{2}  \\
   &=& \lambda_1 \| x \| ^{2}\\
\end{eqnarray}
\begin{itemize}
\item So, how big can the quadratic form be?

\begin{itemize}
\item $x ^{T} Ax \le \lambda_1 x ^{T} x$
\end{itemize}

\item Another important inequality
\end{itemize}
$$
\lambda_n x ^{T} x \le x ^{T} Ax \le \lambda_1 x ^{T} x
$$
\begin{itemize}
\item $\lambda$$_1$ sometimes called $\lambda$ $_{\mathrm{max}}$, $\lambda$ $_{n}$ called $\lambda$ $_{\mathrm{min}}$
\item for \fbox{$A = A ^{T}$} $\in \mathbb{R}^{n\times n}$, $A$ is \emph{positive semidefinite} if $x ^{T} Ax \ge 0$ for all $x$

\begin{itemize}
\item notation: $A\ge0$
\item iff $\lambda _{min} (A) \ge 0$: all eigenvalues nonnegative
\item $A$ is \emph{positive definite} if $x ^{T} Ax >0$ for all $x\ne 0$
\end{itemize}

\item $A\ge 0 \Rightarrow A _{ij} \ge 0$
\item if $A$ not positive or negative [semi]definite, it is \emph{indefinite}
\item matrices \textbf{can be} \emph{incomparable}:

\begin{itemize}
\item $A \ngeq B$ \textbf{and} $B \ngeq A$, where it will depend on the $x$ (depend on the direction you're looking at it from)
\end{itemize}

\item $A \le B$ statement requires that both be square matrices, and probably symmetric (depending on social norms)

\begin{itemize}
\item if not symmetric, it means $\frac{A+A^T}{2} \le \frac{B+B^T}{2}$
\end{itemize}

\end{itemize}
\subsection{Ellipsoids}
\label{sec-15_4}

\begin{itemize}
\item if $A ^{T} > 0$, the set $\mathcal E = \{x | x ^{T} Ax \le 1 \}$ is an \emph{ellipsoid} in $\mathbb{R}^{n}$, centered at 0
\item semi-axes given by $s _{i} = \lambda _{i} ^{-1/2} q _{i}$

\begin{itemize}
\item eigenvectors determine directions of semiaxes
\item eigenvalues determine lengths of semiaxes
\item $\sqrt{\lambda_{max} / \lambda_{min}}$ gives maximum eccentricity
\end{itemize}

\item eigenvalue intuition in $\mathbb{R}^{3}$

\begin{itemize}
\item large pancake shape $\Rightarrow$ one large eigenvalue, two slightly smaller eigenvalues
\item long cigar shape $\Rightarrow$ two large eigenvalues, one small eigenvalue
\end{itemize}

\end{itemize}
\subsection{Gain of matrix in a direction}
\label{sec-15_5}

For $A \in \mathbb{R}^{m\times n}$ (not necessarily symmetric anymore), for $x \in \mathbb{R}^{n}, \|Ax\| / \|x \|$ gives \emph{amplification factor} or \emph{gain} of $A$ in direction $x$, and will vary with different $x$ directions
\begin{itemize}
\item Questions we will ask

\begin{itemize}
\item maximum gain of $A$

\begin{itemize}
\item \fbox{$\displaystyle \max _{x\ne 0} \frac{\|Ax\|}{\|x\|}$}
\item \emph{matrix norm} or \emph{spectral norm}, and denoted $\|A\|$ (overloading)
\item $\displaystyle \max _{x\ne 0} \frac{\|Ax\|}{\|x\|} = \max _{x \ne 0} \frac{x^TA^TAx}{\|x\|^2} = \lambda _{\max} (A ^{T} A)$
\item so, $\|A \|= \sqrt{\lambda _{\max} (A ^{T} A)}$
\end{itemize}

\item minimum gain of $A$

\begin{itemize}
\item $\displaystyle \min _{x\ne 0} \|Ax\| / \|x\| = \sqrt{\lambda _{\min} (A ^{T} A)}$
\end{itemize}

\item how does gain of $A$ vary with direction
\end{itemize}

\item Will give us a \emph{quantitative way} to talk about nullspace
\end{itemize}
\subsection{Example}
\label{sec-15_6}
\subsection{Properties of matrix norm}
\label{sec-15_7}

\begin{itemize}
\item triangle inequality
\item scaling
\item definiteness: $\|A\|= 0 \Leftrightarrow A = 0$
\item norm of a product inequality
\end{itemize}
