lin-dyn-sys-stanford.tex
\section{Lecture 17}
\label{sec-16}
\subsection{SVD}
\label{sec-16_1}

Singular value decomposition, for \emph{any} matrix $A$.
$$
A = U\Sigma V ^{T}
$$
where 
\begin{itemize}
\item $A \in \mathbb{R}^{m\times n}, {\bf Rank} (A) = r$
\item $A \in \mathbb{R}^{m\times r}, U ^{T} U = I$
\item $V \in \mathbb{R}^{n\times r}, V ^{T} V = I$
\item $\Sigma = {\bf diag} (\sigma _{1} ,..., \sigma _{r} )$, where $\sigma _{1} \ge ... \ge \sigma _{r} > 0$
\end{itemize}
\subsection{Dyadic expansion: ($U$ and $V$ have orthonormal columns)}
\label{sec-16_2}

$$
A = U \Sigma V ^{T} = \sum ^{r} _{i=1} \sigma _{i} u _{i} v _{i} ^{T} 
$$
\begin{itemize}
\item $\sigma _{i}$ are the nonzero \emph{singular values} of $A$
\item $v_i$ are the \emph{right} or \emph{input singular vectors} of $A$
\item $u _{i}$ are the \emph{left} or \emph{output singular vectors} of $A$
\end{itemize}
$$
A ^{T} A = (U \Sigma V ^{T} )^{T} (U \Sigma V ^{T}) = V \Sigma ^{2} V ^{T} 
$$
\begin{itemize}
\item $v _{i}$ are eigenvectors of $A ^{T}A$ corresponding to nonzero eigenvalues
\item $\sigma _{i} = \sqrt{\lambda _{i} (A ^{T} A) }$ (and $\lambda _{i} (A ^{T} A) = 0$ for $i>r$)
\item $\|A\| = \sigma _{1}$
\end{itemize}
$$
AA ^{T} = (U \Sigma V ^{T} ) (U \Sigma V ^{T} )^{T} = U \Sigma ^{2} U ^{T} 
$$
\begin{itemize}
\item $u _{i}$ are eigenvectors of $AA ^{T}$ corresponding to nonzero eigenvalues
\item $\sigma _{i} = \sqrt{\lambda _{i} (AA ^{T}) }$ (and $\lambda _{i} (AA ^{T}) = 0$ for $i>r$)
\item $u _{1} ,..., u _{r}$ are orthonormal basis for range($A$)
\item $v _{1} ,..., v _{r}$ are orthonormal basis for $\mathcal{N}(A) ^{\perp}$
\end{itemize}
\subsection{Interpretations}
\label{sec-16_3}

$A = U \Sigma V ^{T}$

linear mapping $y=Ax$ can be decomposed as
\begin{itemize}
\item compute coefficients of $x$ along input directions $v_1,...,v_r$
\item scale coefficients by $\sigma _{i}$
\item reconstitute along output directions $u _{1} ,..., u _{r}$
\item $u _{1}$ is highest gain output direction
\item $v_1$ is most sensitive (highest gain) input direction
\item $A v_1 = \sigma_1 u_1$
\end{itemize}

SVD gives clearer picture of gain as function of input/output directions.
\subsection{General pseudo-inverse}
\label{sec-16_4}

\begin{itemize}
\item $A\ne 0\Rightarrow A=U\Sigma V ^{T}$
\end{itemize}
General pseudo-inverse: \fbox{$A ^{\dagger} = V \Sigma ^{-1} U ^{T}$} is the pseudo-inverse of $A$.

If $A$ is skinny and full rank,
$$
A ^{\dagger} = (A ^{T} A) ^{-1} A ^{T} 
$$
If $A$ is fat and full rank,
$$
A ^{\dagger} = A ^{T} (AA ^{T}) ^{-1} 
$$
In the general case, (if $A$ is not full-rank)
$$
X _{ls} = \{ z: \|Az-y\|= \min _{w} \|Aw-y\| \}
$$
is the set of least squares solutions.

$x _{pinv} = A ^{\dagger} y\in X _{ls}$ has minimum norm on $X _{ls}$, so this is the minimum-norm, least squares solution
\subsection{Pseudo-inverse via regularization}
\label{sec-16_5}

Minimizer of $\|Ax-y\| ^{2} + \mu \|x\| ^{2}$ is given as
$$
x _{\mu} = (A ^{T} A + \mu I) ^{-1} A ^{T} y
$$
\section{Lecture 18}
\label{sec-17}
\subsection{Sensitivity of linear equations to data error}
\label{sec-17_1}

To perturbations $\delta x,\delta y$. Looking at \emph{relative error} gives us
$$
\frac{\|\delta x\|}{\|x\|} \le \|A\| \|A ^{-1} \| \frac{\| \delta y \|}{\|y\|} 
$$

$$
\kappa(A) = \text{ cond}(A) = \|A \| \|A ^{-1} \| = \sigma _{\max} (A) /\sigma _{\min} (A)
$$
So, the relative error in solution $x \le$ condition number $\cdot$ relative error in data $y$. In terms of \# of bits of guaranteed accuracy, `\# of bits accuracy in solution $\approx$ \# bits accuracy in data $-\log _{2} \kappa$.'
\subsection{Low rank applications}
\label{sec-17_2}

If you want to decompose $A$ into $A=BC$, you can remember $QR$ factorization (does skinny-fat factorization), but we'd also want an $A$ that is approximated by such a factorization. Suppose $A \in \mathbb{R}^{m\times n}, {\bf Rank} (A)= r$ with SVD $A=U\Sigma V ^{T} = \sum _{i=1} ^{r} \sigma _{i} u _{i} v _{i} ^{T}$, and we want $\hat A: {\bf Rank} (\hat A) \le p<r: \|A-\hat A\|$ is minimized.

The optimal rank $p$ approximator of $A$ is
$$
\hat A=\sum ^{p} _{i=1} \sigma _{i} u _{i} v _{i} ^{T} 
$$
\begin{itemize}
\item $\|A-\hat A\|= \| \sum ^{r} _{i=p+1} \sigma _{i} u _{i} v _{i} ^{T} \| = \sigma _{p+1}$
\item SVD dyads $u _{i} v _{i} ^{T}$ are ranked in order of `importance'; take $p$ to get rank $p$ approximant
\item keep in mind Frobenius norm $\|A-\hat A\| _{F} = \| A(i)- \hat A(i)\| = \sqrt{\sum _{i,j} (A _{ij} - \hat A _{ij} ) ^{2} }$
\item If you have a set of 100 $\mathbb{R}^{10}$ prices that has dimension=3, it means there are 3 underlying factors; this would give you `stunning' predictive power
\item You would \emph{almost} (i.e., practically) have a dimension 3 matrix if the SVD $\Sigma$ had 3 singular values that were significantly larger than the rest
\end{itemize}
\subsection{State transfer}
\label{sec-17_3}
\subsection{Reachability}
\label{sec-17_4}

Consider state transfer from $x(0)= 0$ to $x(t)$ 
\begin{itemize}
\item $x(t)$ is reachable in $t$ seconds
\item define $\mathcal R _{t} \subseteq \mathbb{R}^{n}$ as the set of points reachable in $t$ seconds for CT system $\dot x=Ax+Bu$,
\end{itemize}
$$
\mathcal R _{t} = \left\{\int ^{t} _{0} e ^{(t-\tau)A} Bu(\tau) d\tau \big| u:[0,t] \rightarrow \mathbb{R}^{m} \right\}
$$
and for DT system $x(t+1)= Ax(t) + Bu(t)$,
$$
\mathcal R _{t} = \left\{\sum ^{t-1} _{\tau=0} A ^{t-1-\tau} Bu(\tau) \big| u(t) \in \mathbb{R}^{m} \right\}
$$
If a state is reachable in 1 s, it's reachable in 2 s (just leave it at zero for the first second) if you're starting from zero initial state (in both CT and DT systems).
\subsection{Reachability for discrete-time LDS}
\label{sec-17_5}

DT system $x(t+1)= Ax(t)+Bu(t), x(t) \in \mathbb{R}^{n}$
$$
x(t)= \mathcal C_t
\begin{bmatrix}
  u(t-1) \\
  \vdots \\
  u(0)   \\
\end{bmatrix}
$$
where $\mathcal C_t = [B \; Ab \; \cdots \; A ^{t-1} B]$. So reachable set at $t$ is $\mathcal{R}_t = \text{range} (\mathcal C_t)$

\fbox{If we want to see if a state is reachable in 1 step, see if it's in the range of $B$.}

\fbox{If we want to see if it's reachable in 2 steps, see if it's in the range of $B,AB$.}
Caley-Hamilton theorem lets us express each $A ^{k}$ for $x\ge n$ as linear combination of $A ^{0} ,...,A ^{n-1}$.
\section{Lecture 19}
\label{sec-18}

But, you can't increase your reach after $t \ge n$ seconds (or epochs). I.e.,
$$
\mathcal R_t = \left\{
\begin{matrix}
  {\bf range} (\mathcal C_t) & \quad t<n    \\
  {\bf range} (\mathcal C)   & \quad t\ge n \\
\end{matrix}
\right.
$$
where $\mathcal C=\mathcal C _{n}$ is the \emph{controllability matrix}.
\subsection{General state transfer}
\label{sec-18_1}

$$
x(t _{f}) = A ^{t_f-t_i} x(t_i) + \mathcal C_{t_f-t_i}
\begin{bmatrix}
  u(t_f-1) \\
  \vdots   \\
  u(t_i)   \\
\end{bmatrix}
$$
\begin{itemize}
\item First term on rhs is what would happen without any input (the drift term)
\end{itemize}
so we can transfer $x(t_i)$ to $x(t_f)=x _{des}$ iff
$$
x _{des} -A ^{t_f-t_i} x(t_i) \in \mathbb{R} _{t_f-t_i} 
$$
\begin{itemize}
\item we're not hoping $x_{des}$ is reachable, we want it minus the drift

\begin{itemize}
\item So it is possible to be able to reach a state in 4 steps, but not in 5
\end{itemize}

\item This reduces to the reachability problem
\item if system is controllable, any state transfer can be achieved in $\le$ \emph{n} steps
\item important special case: driving state to zero
\end{itemize}
\subsection{Minimum time control problem}
\label{sec-18_2}

Given
$$
x(t+1) = Ax(t) + Bu(t), \quad x(0) = x_0
$$
how do you minimize $t$? Check if $A ^{t} x_0 \in \mathcal R ([B \; \cdots \; A ^{t-1} B])$ 
\subsection{Least-norm input for reachability}
\label{sec-18_3}

assume system is reachable, ${\bf Rank} (\mathcal C_t) = n$ to steer $x(0)=0$ to $x(t)= x _{des}$, inputs $u(0),...,u(t-1)$ to satisfy
$$
x _{des} = \mathcal C _{t}
\begin{bmatrix}
  u(t-1) \\
  \vdots \\
  u(0)   \\
\end{bmatrix}
$$
among all $u$ that steer $x(0)= 0$ to $x(t)= x _{des}$, the one that minimizes
$$
\sum ^{t-1} _{\tau=0} \| u(\tau) \| ^{2}
$$
The least-square solution for the input is given by
$$
\begin{bmatrix}
  u _{ln}(t-1) \\
  \vdots       \\
  u _{ln}(0)   \\
\end{bmatrix}
= \mathcal C ^{T} _{t} (\mathcal C _{t} \mathcal C^{T} _{t} ) ^{-1} x _{des} 
$$
