lin-dyn-sys-stanford.org
** Continuous time reachability
consider $\dot x = Ax+Bu$ with $x(t) \in \mathbb{R}^{n}$

reachable set at time $t$ is
$$
\mathcal R _{t} = \left\{ \int ^{t} _{0} e ^{(t-\tau)A} Bu(\tau) d\tau \left| u: \right. [0,t] \rightarrow \mathbb{R}^{m} \right\}
$$
for $t>0$, $\mathcal R _{t} = \mathcal R = {\bf range} (\mathcal C)$ where
$$
\mathcal C = [B \; AB \; \cdots \; A ^{n-1} B]
$$
is the controllability matrix of $(A,B)$
- According to the model, you can hit anything infinitely fast
** Impulsive inputs
** Example
** Least-norm input for reachability
Assume that $\dot x=Ax+Bu$ is reachable. We want $u$ that steers $x(0)=0$ to $x(t)=x _{des}$ and minimizes
$$
\int ^{t} _{0} \| u(\tau) \| ^{2} d\tau
$$
let's discretize system with interval $h=t/N$ (eventually let $N\rightarrow \infty$). So $u$ is piecewise constant:
$$
u(\tau) = u _{d} (k) \text{ for } xh \le \tau < (k+1)h,\quad k=0,...,N-1
$$
...Get long expression for least norm solution for $u$ 
* Lecture 20
** Observability and state estimation
Consider DT system
$$
x(t+1) = Ax(t) + Bu(t) + w(t), \quad y(t)= Cx(t) +Du(t) + v(t)
$$
- $w$ is state disturbance/noise
- $v$ is sensor noise/error
- state estimation problem: estimate $x(s)$ from
$$
u(0),...,u(t-1), \quad y(0), ..., y(t-1)
$$
- $s=0$: estimate initial state
- $s=t-1$: estimate current state
- $s=t$: estimate/predict next state
- estimate $\tilde x(s)$, called /observer/ or /state estimator/
** Noiseless case
Find $x(0)$, with no state or measurement noise
$$
x(t+1) = Ax(t) + Bu(t), \quad y(t)= Cx(t) + Du(t)
$$
then we have
$$
\begin{bmatrix}
  y(0)   \\
  \vdots \\
  y(t-1) \\
\end{bmatrix}
=\mathcal O _{t} x(0) + \mathcal T _{t}
\begin{bmatrix}
  u(0)   \\
  \vdots \\
  u(t-1) \\
\end{bmatrix}
$$


where
$$
\mathcal O_t =
\begin{bmatrix}
  C         \\
  CA        \\
  \vdots    \\
  CA ^{t-1} \\
\end{bmatrix}
\quad
\mathcal T _{t} =
\begin{bmatrix}
  D          & 0          & \cdots &        &   \\
  CB         & D          & 0      & \cdots &   \\
  \vdots     &            &        &        &   \\
  CA ^{t-2}B & CA ^{t-3}B & \cdots & CB     & D \\
\end{bmatrix}
$$
- $\mathcal O _t$ maps initial state into resulting output over $[0,t-1]$
- $\mathcal T_t$ maps input to output over $[0,t-1]$ 
** Observability matrix
** Least-squares observers
** Parting thoughts
*** Linear algebra
*** Levels of understanding
- High school: 17 variables, 17 equations \rightarrow usually has unique solution
  - 80 vars, 60 eqns \rightarrow probably 20 extra degrees of freedom
- Platonic view (`math')
  - singular, rank, range, nullspace, Jordan form, controllability
  - stuff is true or false
- Quantitative
  - based on least-squares, SVD
  - gives numerical measures for ideas like singularity, rank, etc
  - interpretation depends on (practical) context
  - very useful in practice

* Appendix
Some special things to remember.
** Inverse, transpose properties
- $(AB) ^{-1} = B ^{-1} A ^{-1}$
- $(A ^{-1}) ^{T} = (A ^{T}) ^{-1}= A ^{-T}$ 
** Invertibility implications
For an $n$-by-$n$ matrix $A$ 
| Invertible                               | mnemonic                                                                                    |
|------------------------------------------+---------------------------------------------------------------------------------------------|
| $\vert A\vert \ne 0$                     | $\vert A\vert = 0$ \Rightarrow you can't compute the inverse                                |
|                                          | - (remember base case 2 \times 2 matrix inverse involves $1/\vert A\vert$ term)             |
| non-singular                             | singular \Rightarrow the matrix sends a nontrivial subspace to the singular subspace, \{0\} |
| $A$ is full rank                         | linearly independent columns (invertibility \Rightarrow 1-to-1/injective)                   |
| $\mathcal{N}(A)=\{0\}$                   | linearly independent columns                                                                |
| $\mathcal R (A)= \mathbb{R}^{n}$         | linearly independent columns                                                                |
| $Ax=b$ has unique solution for every $b$ | - no more than one solution (can't add members of $\mathcal N (A)$ for multiple $b$)        |
|                                          | - one solution, since $\mathcal R (A)= \mathbb{R}^{n}$; everything reachable/surjective     |
|                                          | - one solution found using the unique inverse of /A/                                        |
| rref($A)=I_n$                            |                                                                                             |
| $A$ is a product of elementary matrices  |                                                                                             |
** Tips
- to sum up all the elements in matrix $A$, multiply by one vectors: $\displaystyle \sum _{i,j} (A) _{i,j} = {\bf 1} ^{T} A {\bf 1}$ 
- each row $i$ in $Z$ is a linear combination of rows $i,...,n$ in $Y: Z=UY$, where $U$ is upper triangular: $U _{ij} =0$ for $i>j$
  - more in 2.24, hw2
- $E _{i,j} = e _{i} e _{j} ^{T} \in \mathbb{R}^{n\times n}, i,j=1,...,n$ is $n\times n$ matrix with a 1 in $i,j$ th entry, and zero elsewhere
  - has $n^2$ dimensions
- When you do a polynomial of a similarity matrix, you can pull out the outer matrices: $\mathcal X(T\Lambda T ^{-1} ) = T \mathcal X(\Lambda) T ^{-1}$
- If $AB=0$, and each is full rank, (neither is zero), then $\mathcal R (B) \subseteq \mathcal N (A)$
- $A ^{k} = 0, k\ge 1\Rightarrow$ eigenvalues of $A$ are zero. If $A$ is diagonalizable, then $A ^{k}$ can be expressed as $T \Lambda ^{k} T ^{-1}$, where \Lambda is diagonal, consisting of the eigenvalues multiplied by the $k$ th power, since $T$ is non-singular.
  - ${\bf Rank}(A)=r \Rightarrow A \in \mathbb{R}^{n\times n}$ has exactly $r$ non-zero eigenvalues
- Every eigenvalue of $AB$ is an eigenvalue of $BA$, if $A,B \in \mathbb{R}^{n\times n}$: Given \lambda is eigenvalue of $AB:ABv=\lambda v, BA(Bv)=B(AB)v=\lambda Bv$. Thus $Bv$ is an eigenvector of $BA$ assocated with \lambda
- To check whether \fbox{$x\in \mathcal R(A)$}, check whether \fbox{$rank([A \;x])= rank(A)$ }
- Least squares approximation that minimizes $x$ in $Ax=y, x _{ls} = (A ^{T} A) ^{-1} A ^{T} y$ is given in MATLAB by =xls=A\y;=
  - only works if $A$ is skinny or square
  - compute using QR (economy) factorization with
    : [Q,R]=qr(A,0); % compute economy QR decomposition
    : xls=R\(Q'*y);
- Least norm solution, $x _{ln} = A ^{T} (AA ^{T} ) ^{-1} y$, can be computed by =xln=A'*inv(A*A')*y;=
  - $A$ cannot be full rank or skinny
  - via QR factorization:
	: [Q,R]=qr(A',0);
	: xln=Q*(R'\y);
    - for more, see [[~/Dropbox/AK-MBP/edu/systems/IntroToLinearDynamicalSys/materials/lsoeldsee263/Additional5-sle_matlab.pdf][here]]
** Unrelated stuff
*** Series
\begin{eqnarray}
 S &=&\sum ^{N} _{k=0} a ^{k} =a ^{0} + a ^{1} + ...+ a ^{N} \\
 aS &=&\sum ^{N} _{k=0} a ^{k} =a ^{1} + a ^{1} + ...+ a ^{N+1} \\
 aS-S &=& -1+a ^{N+1} \\
 S &=& \frac{a^{N+1}-1}{a-1}
\end{eqnarray}
