lin-dyn-sys-stanford.tex
\subsection{Stability}
\label{sec-18_4}
\subsection{Continuous time reachability}
\label{sec-18_5}

consider $\dot x = Ax+Bu$ with $x(t) \in \mathbb{R}^{n}$

reachable set at time $t$ is
$$
\mathcal R _{t} = \left\{ \int ^{t} _{0} e ^{(t-\tau)A} Bu(\tau) d\tau \left| u: \right. [0,t] \rightarrow \mathbb{R}^{m} \right\}
$$
for $t>0$, $\mathcal R _{t} = \mathcal R = {\bf range} (\mathcal C)$ where
$$
\mathcal C = [B \; AB \; \cdots \; A ^{n-1} B]
$$
is the controllability matrix of $(A,B)$
\begin{itemize}
\item According to the model, you can hit anything infinitely fast
\end{itemize}
\subsection{Impulsive inputs}
\label{sec-18_6}
\subsection{Example}
\label{sec-18_7}
\subsection{Least-norm input for reachability}
\label{sec-18_8}

Assume that $\dot x=Ax+Bu$ is reachable. We want $u$ that steers $x(0)=0$ to $x(t)=x _{des}$ and minimizes
$$
\int ^{t} _{0} \| u(\tau) \| ^{2} d\tau
$$
let's discretize system with interval $h=t/N$ (eventually let $N\rightarrow \infty$). So $u$ is piecewise constant:
$$
u(\tau) = u _{d} (k) \text{ for } xh \le \tau < (k+1)h,\quad k=0,...,N-1
$$
\ldots{}Get long expression for least norm solution for $u$ 
\section{Lecture 20}
\label{sec-19}
\subsection{Observability and state estimation}
\label{sec-19_1}

Consider DT system
$$
x(t+1) = Ax(t) + Bu(t) + w(t), \quad y(t)= Cx(t) +Du(t) + v(t)
$$
\begin{itemize}
\item $w$ is state disturbance/noise
\item $v$ is sensor noise/error
\item state estimation problem: estimate $x(s)$ from
\end{itemize}
$$
u(0),...,u(t-1), \quad y(0), ..., y(t-1)
$$
\begin{itemize}
\item $s=0$: estimate initial state
\item $s=t-1$: estimate current state
\item $s=t$: estimate/predict next state
\item estimate $\tilde x(s)$, called \emph{observer} or \emph{state estimator}
\end{itemize}
\subsection{Noiseless case}
\label{sec-19_2}

Find $x(0)$, with no state or measurement noise
$$
x(t+1) = Ax(t) + Bu(t), \quad y(t)= Cx(t) + Du(t)
$$
then we have
$$
\begin{bmatrix}
  y(0)   \\
  \vdots \\
  y(t-1) \\
\end{bmatrix}
=\mathcal O _{t} x(0) + \mathcal T _{t}
\begin{bmatrix}
  u(0)   \\
  \vdots \\
  u(t-1) \\
\end{bmatrix}
$$


where
$$
\mathcal O_t =
\begin{bmatrix}
  C         \\
  CA        \\
  \vdots    \\
  CA ^{t-1} \\
\end{bmatrix}
\quad
\mathcal T _{t} =
\begin{bmatrix}
  D          & 0          & \cdots &        &   \\
  CB         & D          & 0      & \cdots &   \\
  \vdots     &            &        &        &   \\
  CA ^{t-2}B & CA ^{t-3}B & \cdots & CB     & D \\
\end{bmatrix}
$$
\begin{itemize}
\item $\mathcal O _t$ maps initial state into resulting output over $[0,t-1]$
\item $\mathcal T_t$ maps input to output over $[0,t-1]$
\end{itemize}
\subsection{Observability matrix}
\label{sec-19_3}
\subsection{Least-squares observers}
\label{sec-19_4}
\subsection{Parting thoughts}
\label{sec-19_5}
\subsubsection{Linear algebra}
\label{sec-19_5_1}
\subsubsection{Levels of understanding}
\label{sec-19_5_2}

\begin{itemize}
\item High school: 17 variables, 17 equations $\rightarrow$ usually has unique solution

\begin{itemize}
\item 80 vars, 60 eqns $\rightarrow$ probably 20 extra degrees of freedom
\end{itemize}

\item Platonic view (`math')

\begin{itemize}
\item singular, rank, range, nullspace, Jordan form, controllability
\item stuff is true or false
\end{itemize}

\item Quantitative

\begin{itemize}
\item based on least-squares, SVD
\item gives numerical measures for ideas like singularity, rank, etc
\item interpretation depends on (practical) context
\item very useful in practice
\end{itemize}

\end{itemize}
\section{Appendix}
\label{sec-20}

Some special things to remember.
\subsection{Inverse, transpose properties}
\label{sec-20_1}

\begin{itemize}
\item $(AB) ^{-1} = B ^{-1} A ^{-1}$
\item $(A ^{-1}) ^{T} = (A ^{T}) ^{-1}= A ^{-T}$
\end{itemize}
\subsection{Invertibility implications}
\label{sec-20_2}

For an $n$-by-$n$ matrix $A$ 

\begin{center}
\begin{tabular}{ll}
 Invertible                                &  mnemonic                                                                                       \\
\hline
 $\vert A\vert \ne 0$                      &  $\vert A\vert = 0$ $\Rightarrow$ you can't compute the inverse                                 \\
                                           &  - (remember base case 2 \texttimes{} 2 matrix inverse involves $1/\vert A\vert$ term)          \\
 non-singular                              &  singular $\Rightarrow$ the matrix sends a nontrivial subspace to the singular subspace, \{0\}  \\
 $A$ is full rank                          &  linearly independent columns (invertibility $\Rightarrow$ 1-to-1/injective)                    \\
 $\mathcal{N}(A)=\{0\}$                    &  linearly independent columns                                                                   \\
 $\mathcal R (A)= \mathbb{R}^{n}$          &  linearly independent columns                                                                   \\
 $Ax=b$ has unique solution for every $b$  &  - no more than one solution (can't add members of $\mathcal N (A)$ for multiple $b$)           \\
                                           &  - one solution, since $\mathcal R (A)= \mathbb{R}^{n}$; everything reachable/surjective        \\
                                           &  - one solution found using the unique inverse of \emph{A}                                      \\
 rref($A)=I_n$                             &                                                                                                 \\
 $A$ is a product of elementary matrices   &                                                                                                 \\
\end{tabular}
\end{center}
\subsection{Tips}
\label{sec-20_3}

\begin{itemize}
\item to sum up all the elements in matrix $A$, multiply by one vectors: $\displaystyle \sum _{i,j} (A) _{i,j} = {\bf 1} ^{T} A {\bf 1}$
\item each row $i$ in $Z$ is a linear combination of rows $i,...,n$ in $Y: Z=UY$, where $U$ is upper triangular: $U _{ij} =0$ for $i>j$

\begin{itemize}
\item more in 2.24, hw2
\end{itemize}

\item $E _{i,j} = e _{i} e _{j} ^{T} \in \mathbb{R}^{n\times n}, i,j=1,...,n$ is $n\times n$ matrix with a 1 in $i,j$ th entry, and zero elsewhere

\begin{itemize}
\item has $n^2$ dimensions
\end{itemize}

\item When you do a polynomial of a similarity matrix, you can pull out the outer matrices: $\mathcal X(T\Lambda T ^{-1} ) = T \mathcal X(\Lambda) T ^{-1}$
\item If $AB=0$, and each is full rank, (neither is zero), then $\mathcal R (B) \subseteq \mathcal N (A)$
\item $A ^{k} = 0, k\ge 1\Rightarrow$ eigenvalues of $A$ are zero. If $A$ is diagonalizable, then $A ^{k}$ can be expressed as $T \Lambda ^{k} T ^{-1}$, where $\Lambda$ is diagonal, consisting of the eigenvalues multiplied by the $k$ th power, since $T$ is non-singular.

\begin{itemize}
\item ${\bf Rank}(A)=r \Rightarrow A \in \mathbb{R}^{n\times n}$ has exactly $r$ non-zero eigenvalues
\end{itemize}

\item Every eigenvalue of $AB$ is an eigenvalue of $BA$, if $A,B \in \mathbb{R}^{n\times n}$: Given $\lambda$ is eigenvalue of $AB:ABv=\lambda v, BA(Bv)=B(AB)v=\lambda Bv$. Thus $Bv$ is an eigenvector of $BA$ assocated with $\lambda$
\item To check whether \fbox{$x\in \mathcal R(A)$}, check whether \fbox{$rank([A \;x])= rank(A)$ }
\item Least squares approximation that minimizes $x$ in $Ax=y, x _{ls} = (A ^{T} A) ^{-1} A ^{T} y$ is given in MATLAB by \texttt{xls=A\textbackslash{}y;}

\begin{itemize}
\item only works if $A$ is skinny or square
\item compute using QR (economy) factorization with
\begin{verbatim}
     [Q,R]=qr(A,0); % compute economy QR decomposition
     xls=R\(Q'*y);
\end{verbatim}

\end{itemize}

\item Least norm solution, $x _{ln} = A ^{T} (AA ^{T} ) ^{-1} y$, can be computed by \texttt{xln=A'*inv(A*A')*y;}

\begin{itemize}
\item $A$ cannot be full rank or skinny
\item via QR factorization:
\begin{verbatim}
     [Q,R]=qr(A',0);
     xln=Q*(R'\y);
\end{verbatim}


\begin{itemize}
\item for more, see \href{file:///Users/FingerMan/Dropbox/AK-MBP/edu/systems/IntroToLinearDynamicalSys/materials/lsoeldsee263/Additional5-sle_matlab.pdf}{here}
\end{itemize}

\end{itemize}

\end{itemize}
\subsection{Unrelated stuff}
\label{sec-20_4}
\subsubsection{Series}
\label{sec-20_4_1}

\begin{eqnarray}
 S &=&\sum ^{N} _{k=0} a ^{k} =a ^{0} + a ^{1} + ...+ a ^{N} \\
 aS &=&\sum ^{N} _{k=0} a ^{k} =a ^{1} + a ^{1} + ...+ a ^{N+1} \\
 aS-S &=& -1+a ^{N+1} \\
 S &=& \frac{a^{N+1}-1}{a-1}
\end{eqnarray}
