lin-dyn-sys-stanford.tex
\subsubsection{Taylor/Mclauren}
\label{sec-20_4_2}

Intuition for approximating a function at a point (say at $x=0$): assuming we know $f(0),f'(0),f''(0),f'''(0)$, put into polynomials
\begin{eqnarray}
  p_0(x) &=& f(0) \\
  p_1(x) &=& f(0) + f'(0)x \\
  p_2(x) &=& f(0) + f'(0)x + \frac{1}{2} f''(0)x^2 \\
  p_3(x) &=& f(0) + f'(0)x + \frac{1}{2} f''(0)x^2 + \frac{1}{2} \frac{1}{3} f'''(0) x^3 \\
\end{eqnarray}
Our polynomial $p_n(x)$ will both have the same value at $x=0$, as well as the same \emph{n} th derivatives when evaluated at 0. I.e.,
\begin{eqnarray}
  p_2'(x) &=& f'(0) + f''(0) x \\
  p_2'(0) &=& f'(0) \\
\end{eqnarray}
In general, the $n$ th order McLauren approximation polynomial of $f(x)$ at point $x_1$ will be given as
$$
f(x) \approx f(x_1) + f'(x_1)x + \frac{1}{2} f''(x_1) x ^{2} + \frac{1}{2\cdot 3} f ^{(3)} x ^{3} + ... + \frac{1}{n!} f ^{(n)} x ^{n} 
$$ 
In general, the $n$ th order Taylor approximation polynomial of $f(x)$ at point $c$ will be given as
$$
f(x) \approx f(c) + f'(c)(x-c) + \frac{1}{2} f''(c) (x-c) ^{2} + ... + \frac{1}{n!} f ^{(n)} (x-c) ^{n} 
$$ 
So when you evaluate derivatives at $x=c$, the higher order terms will still drop to zero, leaving you with the exact derivative value.
\begin{itemize}

\item Cosine McLauren (around 0)\\
\label{sec-20_4_2_1}%
$$
\cos (x) = 1- \frac{x^2}{2!} + \frac{x^4}{4!} - \frac{x^6}{6!} + ...
$$ 

\item Sine McLauren (around 0)\\
\label{sec-20_4_2_2}%
$$
\sin(x) = x- \frac{x^3}{3!} + \frac{x^5}{5!} - \frac{x^7}{7!} + ...
$$ 

\item e McLauren (around 0)\\
\label{sec-20_4_2_3}%
$$
e ^{x} = 1+x + \frac{x^2}{2!} + \frac{x^3}{3!} + ...
$$ 
\end{itemize} % ends low level
\section{Homework assignments}
\label{sec-21}


\begin{center}
\begin{tabular}{lll}
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw1sol.pdf}{Homework 1}  &  Lecture 4   &  2.12.4, 2.6, 2.9, 2.12, +                                                \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw2sol.pdf}{Homework 2}  &  Lecture 6   &  3.2, 3.3, 3.10, 3.11, 3.16, 3.17, +                                       \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw3sol.pdf}{Homework 3}  &  Lecture 8   &  2.17, 3.13, 4.14.3, 5.1, 6.9, +                                          \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw4sol.pdf}{Homework 4}  &  Lecture 10  &  5.2, 6.2, 6.5, 6.12, 6.14, 6.26, 7.3, 8.2                                 \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw5sol.pdf}{Homework 5}  &  Lecture 13  &  10.2, 10.3, 10.4, +                                                       \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw6sol.pdf}{Homework 6}  &  Lecture 14  &  9.9, 10.5, 10.6, 10.8, 10.14, 11.3, and 11.6a                             \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw7sol.pdf}{Homework 7}  &  Lecture 16  &  10.9, 10.11, 10.19, 11.13, 12.1, 13.1, +                                  \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw8sol.pdf}{Homework 8}  &  Lecture 18  &  13.17, 14.2, 14.3, 14.4, 14.6, 14.8, 14.9, 14.11, 14.13, 14.21, 14.33, +  \\
 \href{file:///Users/FingerMan/Desktop/Engineering/eng-control-and-cv/stanford hw/hw9sol.pdf}{Homework 9}  &  Lecture 20  &  14.16, 14.26, 15.2, 15.3, 15.6, 15.8, 15.10, and 15.11                    \\
\end{tabular}
\end{center}

\end{document}